zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_ME.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_MC_ME.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_MC_ME
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_MC_ME_H_)  /* Check if memory map has not been already included */
#define S32K566_MC_ME_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- MC_ME Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MC_ME_Peripheral_Access_Layer MC_ME Peripheral Access Layer
 * @{
 */

/** MC_ME - Register Layout Typedef */
typedef struct MC_ME_Struct {
  __IO uint32_t CTL_KEY;                           /**< Control Key Register, offset: 0x0 */
  uint8_t RESERVED_0[252];
  __IO uint32_t PRTN0_PCONF;                       /**< Partition 0 Process Configuration Register, offset: 0x100 */
  __IO uint32_t PRTN0_PUPD;                        /**< Partition 0 Process Update Register, offset: 0x104 */
  __I  uint32_t PRTN0_STAT;                        /**< Partition 0 Status Register, offset: 0x108 */
  __IO uint32_t PRTN0_CORE_LOCKSTEP;               /**< Partition 0 Core Lockstep Control Register, offset: 0x10C, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __I  uint32_t PRTN0_COFB0_STAT;                  /**< Partition 0 COFB Set 0 Clock Status Register, offset: 0x110 */
  __I  uint32_t PRTN0_COFB1_STAT;                  /**< Partition 0 COFB Set 1 Clock Status Register, offset: 0x114 */
  __I  uint32_t PRTN0_COFB2_STAT;                  /**< Partition 0 COFB Set 2 Clock Status Register, offset: 0x118, available only on: LPE_MC_ME, MC_ME (missing on CPE_MC_ME) */
  __I  uint32_t PRTN0_COFB3_STAT;                  /**< Partition 0 COFB Set 3 Clock Status Register, offset: 0x11C, available only on: LPE_MC_ME (missing on CPE_MC_ME, MC_ME) */
  uint8_t RESERVED_1[16];
  __IO uint32_t PRTN0_COFB0_CLKEN;                 /**< Partition 0 COFB Set 0 Clock Enable Register, offset: 0x130 */
  __IO uint32_t PRTN0_COFB1_CLKEN;                 /**< Partition 0 COFB Set 1 Clock Enable Register, offset: 0x134 */
  __IO uint32_t PRTN0_COFB2_CLKEN;                 /**< Partition 0 COFB Set 2 Clock Enable Register, offset: 0x138, available only on: LPE_MC_ME, MC_ME (missing on CPE_MC_ME) */
  __IO uint32_t PRTN0_COFB3_CLKEN;                 /**< Partition 0 COFB Set 3 Clock Enable Register, offset: 0x13C, available only on: LPE_MC_ME (missing on CPE_MC_ME, MC_ME) */
  __IO uint32_t PRTN0_CORE0_PCONF;                 /**< Partition 0 Core 0 Process Configuration Register, offset: 0x140 */
  __IO uint32_t PRTN0_CORE0_PUPD;                  /**< Partition 0 Core 0 Process Update Register, offset: 0x144 */
  __I  uint32_t PRTN0_CORE0_STAT;                  /**< Partition 0 Core 0 Status Register, offset: 0x148 */
  __IO uint32_t PRTN0_CORE0_ADDR;                  /**< Partition 0 Core 0 Address Register, offset: 0x14C */
  uint8_t RESERVED_2[16];
  __IO uint32_t PRTN0_CORE1_PCONF;                 /**< Partition 0 Core 1 Process Configuration Register, offset: 0x160, available only on: CPE_MC_ME, MC_ME (missing on LPE_MC_ME) */
  __IO uint32_t PRTN0_CORE1_PUPD;                  /**< Partition 0 Core 1 Process Update Register, offset: 0x164, available only on: CPE_MC_ME, MC_ME (missing on LPE_MC_ME) */
  __I  uint32_t PRTN0_CORE1_STAT;                  /**< Partition 0 Core 1 Status Register, offset: 0x168, available only on: CPE_MC_ME, MC_ME (missing on LPE_MC_ME) */
  __IO uint32_t PRTN0_CORE1_ADDR;                  /**< Partition 0 Core 1 Address Register, offset: 0x16C, available only on: CPE_MC_ME, MC_ME (missing on LPE_MC_ME) */
  uint8_t RESERVED_3[16];
  __IO uint32_t PRTN0_CORE2_PCONF;                 /**< Partition 0 Core 2 Process Configuration Register, offset: 0x180, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __IO uint32_t PRTN0_CORE2_PUPD;                  /**< Partition 0 Core 2 Process Update Register, offset: 0x184, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __I  uint32_t PRTN0_CORE2_STAT;                  /**< Partition 0 Core 2 Status Register, offset: 0x188, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __IO uint32_t PRTN0_CORE2_ADDR;                  /**< Partition 0 Core 2 Address Register, offset: 0x18C, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  uint8_t RESERVED_4[16];
  __IO uint32_t PRTN0_CORE3_PCONF;                 /**< Partition 0 Core 3 Process Configuration Register, offset: 0x1A0, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __IO uint32_t PRTN0_CORE3_PUPD;                  /**< Partition 0 Core 3 Process Update Register, offset: 0x1A4, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __I  uint32_t PRTN0_CORE3_STAT;                  /**< Partition 0 Core 3 Status Register, offset: 0x1A8, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __IO uint32_t PRTN0_CORE3_ADDR;                  /**< Partition 0 Core 3 Address Register, offset: 0x1AC, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  uint8_t RESERVED_5[16];
  __IO uint32_t PRTN0_CORE4_PCONF;                 /**< Partition 0 Core 4 Process Configuration Register, offset: 0x1C0, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __IO uint32_t PRTN0_CORE4_PUPD;                  /**< Partition 0 Core 4 Process Update Register, offset: 0x1C4, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __I  uint32_t PRTN0_CORE4_STAT;                  /**< Partition 0 Core 4 Status Register, offset: 0x1C8, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __IO uint32_t PRTN0_CORE4_ADDR;                  /**< Partition 0 Core 4 Address Register, offset: 0x1CC, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  uint8_t RESERVED_6[16];
  __IO uint32_t PRTN0_CORE5_PCONF;                 /**< Partition 0 Core 5 Process Configuration Register, offset: 0x1E0, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __IO uint32_t PRTN0_CORE5_PUPD;                  /**< Partition 0 Core 5 Process Update Register, offset: 0x1E4, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __I  uint32_t PRTN0_CORE5_STAT;                  /**< Partition 0 Core 5 Status Register, offset: 0x1E8, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __IO uint32_t PRTN0_CORE5_ADDR;                  /**< Partition 0 Core 5 Address Register, offset: 0x1EC, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  uint8_t RESERVED_7[24];
  __I  uint32_t PRTN0_CORE6_STAT;                  /**< Partition 0 Core 6 Status Register, offset: 0x208, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __I  uint32_t PRTN0_CORE6_ADDR;                  /**< Partition 0 Core 6 Address Register, offset: 0x20C, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  uint8_t RESERVED_8[16];
  __IO uint32_t PRTN0_CORE7_PCONF;                 /**< Partition 0 Core 7 Process Configuration Register, offset: 0x220, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __IO uint32_t PRTN0_CORE7_PUPD;                  /**< Partition 0 Core 7 Process Update Register, offset: 0x224, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __I  uint32_t PRTN0_CORE7_STAT;                  /**< Partition 0 Core 7 Status Register, offset: 0x228, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __IO uint32_t PRTN0_CORE7_ADDR;                  /**< Partition 0 Core 7 Address Register, offset: 0x22C, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  uint8_t RESERVED_9[208];
  __IO uint32_t PRTN1_PCONF;                       /**< Partition 1 Process Configuration Register, offset: 0x300, available only on: CPE_MC_ME, MC_ME (missing on LPE_MC_ME) */
  __IO uint32_t PRTN1_PUPD;                        /**< Partition 1 Process Update Register, offset: 0x304, available only on: CPE_MC_ME, MC_ME (missing on LPE_MC_ME) */
  __I  uint32_t PRTN1_STAT;                        /**< Partition 1 Status Register, offset: 0x308, available only on: CPE_MC_ME, MC_ME (missing on LPE_MC_ME) */
  uint8_t RESERVED_10[4];
  __I  uint32_t PRTN1_COFB0_STAT;                  /**< Partition 1 COFB Set 0 Clock Status Register, offset: 0x310, available only on: CPE_MC_ME, MC_ME (missing on LPE_MC_ME) */
  __I  uint32_t PRTN1_COFB1_STAT;                  /**< Partition 1 COFB Set 1 Clock Status Register, offset: 0x314, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  uint8_t RESERVED_11[24];
  __IO uint32_t PRTN1_COFB0_CLKEN;                 /**< Partition 1 COFB Set 0 Clock Enable Register, offset: 0x330, available only on: CPE_MC_ME, MC_ME (missing on LPE_MC_ME) */
  __IO uint32_t PRTN1_COFB1_CLKEN;                 /**< Partition 1 COFB Set 1 Clock Enable Register, offset: 0x334, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  uint8_t RESERVED_12[8];
  __IO uint32_t PRTN1_CORE0_PCONF;                 /**< Partition 1 Core 0 Process Configuration Register, offset: 0x340, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __IO uint32_t PRTN1_CORE0_PUPD;                  /**< Partition 1 Core 0 Process Update Register, offset: 0x344, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __I  uint32_t PRTN1_CORE0_STAT;                  /**< Partition 1 Core 0 Status Register, offset: 0x348, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __IO uint32_t PRTN1_CORE0_ADDR;                  /**< Partition 1 Core 0 Address Register, offset: 0x34C, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  uint8_t RESERVED_13[432];
  __IO uint32_t PRTN2_PCONF;                       /**< Partition 2 Process Configuration Register, offset: 0x500, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __IO uint32_t PRTN2_PUPD;                        /**< Partition 2 Process Update Register, offset: 0x504, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __I  uint32_t PRTN2_STAT;                        /**< Partition 2 Status Register, offset: 0x508, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  uint8_t RESERVED_14[4];
  __I  uint32_t PRTN2_COFB0_STAT;                  /**< Partition 2 COFB Set 0 Clock Status Register, offset: 0x510, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __I  uint32_t PRTN2_COFB1_STAT;                  /**< Partition 2 COFB Set 1 Clock Status Register, offset: 0x514, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __I  uint32_t PRTN2_COFB2_STAT;                  /**< Partition 2 COFB Set 2 Clock Status Register, offset: 0x518, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __I  uint32_t PRTN2_COFB3_STAT;                  /**< Partition 2 COFB Set 3 Clock Status Register, offset: 0x51C, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  uint8_t RESERVED_15[16];
  __IO uint32_t PRTN2_COFB0_CLKEN;                 /**< Partition 2 COFB Set 0 Clock Enable Register, offset: 0x530, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __IO uint32_t PRTN2_COFB1_CLKEN;                 /**< Partition 2 COFB Set 1 Clock Enable Register, offset: 0x534, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __IO uint32_t PRTN2_COFB2_CLKEN;                 /**< Partition 2 COFB Set 2 Clock Enable Register, offset: 0x538, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __IO uint32_t PRTN2_COFB3_CLKEN;                 /**< Partition 2 COFB Set 3 Clock Enable Register, offset: 0x53C, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  uint8_t RESERVED_16[448];
  __IO uint32_t PRTN3_PCONF;                       /**< Partition 3 Process Configuration Register, offset: 0x700, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __IO uint32_t PRTN3_PUPD;                        /**< Partition 3 Process Update Register, offset: 0x704, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __I  uint32_t PRTN3_STAT;                        /**< Partition 3 Status Register, offset: 0x708, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  uint8_t RESERVED_17[4];
  __I  uint32_t PRTN3_COFB0_STAT;                  /**< Partition 3 COFB Set 0 Clock Status Register, offset: 0x710, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __I  uint32_t PRTN3_COFB1_STAT;                  /**< Partition 3 COFB Set 1 Clock Status Register, offset: 0x714, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  uint8_t RESERVED_18[24];
  __IO uint32_t PRTN3_COFB0_CLKEN;                 /**< Partition 3 COFB Set 0 Clock Enable Register, offset: 0x730, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __IO uint32_t PRTN3_COFB1_CLKEN;                 /**< Partition 3 COFB Set 1 Clock Enable Register, offset: 0x734, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  uint8_t RESERVED_19[456];
  __IO uint32_t PRTN4_PCONF;                       /**< Partition 4 Process Configuration Register, offset: 0x900, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __IO uint32_t PRTN4_PUPD;                        /**< Partition 4 Process Update Register, offset: 0x904, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __I  uint32_t PRTN4_STAT;                        /**< Partition 4 Status Register, offset: 0x908, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  uint8_t RESERVED_20[4];
  __I  uint32_t PRTN4_COFB0_STAT;                  /**< Partition 4 COFB Set 0 Clock Status Register, offset: 0x910, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __I  uint32_t PRTN4_COFB1_STAT;                  /**< Partition 4 COFB Set 1 Clock Status Register, offset: 0x914, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  uint8_t RESERVED_21[24];
  __IO uint32_t PRTN4_COFB0_CLKEN;                 /**< Partition 4 COFB Set 0 Clock Enable Register, offset: 0x930, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __IO uint32_t PRTN4_COFB1_CLKEN;                 /**< Partition 4 COFB Set 1 Clock Enable Register, offset: 0x934, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  uint8_t RESERVED_22[456];
  __IO uint32_t PRTN5_PCONF;                       /**< Partition 5 Process Configuration Register, offset: 0xB00, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __IO uint32_t PRTN5_PUPD;                        /**< Partition 5 Process Update Register, offset: 0xB04, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __I  uint32_t PRTN5_STAT;                        /**< Partition 5 Status Register, offset: 0xB08, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  uint8_t RESERVED_23[4];
  __I  uint32_t PRTN5_COFB0_STAT;                  /**< Partition 5 COFB Set 0 Clock Status Register, offset: 0xB10, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __I  uint32_t PRTN5_COFB1_STAT;                  /**< Partition 5 COFB Set 1 Clock Status Register, offset: 0xB14, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __I  uint32_t PRTN5_COFB2_STAT;                  /**< Partition 5 COFB Set 2 Clock Status Register, offset: 0xB18, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __I  uint32_t PRTN5_COFB3_STAT;                  /**< Partition 5 COFB Set 3 Clock Status Register, offset: 0xB1C, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  uint8_t RESERVED_24[16];
  __IO uint32_t PRTN5_COFB0_CLKEN;                 /**< Partition 5 COFB Set 0 Clock Enable Register, offset: 0xB30, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __IO uint32_t PRTN5_COFB1_CLKEN;                 /**< Partition 5 COFB Set 1 Clock Enable Register, offset: 0xB34, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __IO uint32_t PRTN5_COFB2_CLKEN;                 /**< Partition 5 COFB Set 2 Clock Enable Register, offset: 0xB38, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
  __IO uint32_t PRTN5_COFB3_CLKEN;                 /**< Partition 5 COFB Set 3 Clock Enable Register, offset: 0xB3C, available only on: MC_ME (missing on CPE_MC_ME, LPE_MC_ME) */
} MC_ME_Type, *MC_ME_MemMapPtr;

/** Number of instances of the MC_ME module. */
#define MC_ME_INSTANCE_COUNT                     (3u)

/* MC_ME - Peripheral instance base addresses */
/** Peripheral CPE_MC_ME base address */
#define IP_CPE_MC_ME_BASE                        (0x41050000u)
/** Peripheral CPE_MC_ME base pointer */
#define IP_CPE_MC_ME                             ((MC_ME_Type *)IP_CPE_MC_ME_BASE)
/** Peripheral LPE_MC_ME base address */
#define IP_LPE_MC_ME_BASE                        (0x4206C000u)
/** Peripheral LPE_MC_ME base pointer */
#define IP_LPE_MC_ME                             ((MC_ME_Type *)IP_LPE_MC_ME_BASE)
/** Peripheral MC_ME base address */
#define IP_MC_ME_BASE                            (0x40498000u)
/** Peripheral MC_ME base pointer */
#define IP_MC_ME                                 ((MC_ME_Type *)IP_MC_ME_BASE)
/** Array initializer of MC_ME peripheral base addresses */
#define IP_MC_ME_BASE_ADDRS                      { IP_CPE_MC_ME_BASE, IP_LPE_MC_ME_BASE, IP_MC_ME_BASE }
/** Array initializer of MC_ME peripheral base pointers */
#define IP_MC_ME_BASE_PTRS                       { IP_CPE_MC_ME, IP_LPE_MC_ME, IP_MC_ME }

/* ----------------------------------------------------------------------------
   -- MC_ME Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MC_ME_Register_Masks MC_ME Register Masks
 * @{
 */

/*! @name CTL_KEY - Control Key Register */
/*! @{ */

#define MC_ME_CTL_KEY_KEY_MASK                   (0xFFFFU)
#define MC_ME_CTL_KEY_KEY_SHIFT                  (0U)
#define MC_ME_CTL_KEY_KEY_WIDTH                  (16U)
#define MC_ME_CTL_KEY_KEY(x)                     (((uint32_t)(((uint32_t)(x)) << MC_ME_CTL_KEY_KEY_SHIFT)) & MC_ME_CTL_KEY_KEY_MASK)
/*! @} */

/*! @name PRTN0_PCONF - Partition 0 Process Configuration Register */
/*! @{ */

#define MC_ME_PRTN0_PCONF_PCE_MASK               (0x1U)
#define MC_ME_PRTN0_PCONF_PCE_SHIFT              (0U)
#define MC_ME_PRTN0_PCONF_PCE_WIDTH              (1U)
#define MC_ME_PRTN0_PCONF_PCE(x)                 (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_PCONF_PCE_SHIFT)) & MC_ME_PRTN0_PCONF_PCE_MASK)
/*! @} */

