zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_ME.h
#define MC_ME_PRTN0_COFB0_STAT_BLOCK18_MASK      (0x40000U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK18_SHIFT     (18U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK18_WIDTH     (1U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK18(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_STAT_BLOCK18_SHIFT)) & MC_ME_PRTN0_COFB0_STAT_BLOCK18_MASK)

#define MC_ME_PRTN0_COFB0_STAT_BLOCK19_MASK      (0x80000U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK19_SHIFT     (19U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK19_WIDTH     (1U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK19(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_STAT_BLOCK19_SHIFT)) & MC_ME_PRTN0_COFB0_STAT_BLOCK19_MASK)

#define MC_ME_PRTN0_COFB0_STAT_BLOCK20_MASK      (0x100000U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK20_SHIFT     (20U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK20_WIDTH     (1U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK20(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_STAT_BLOCK20_SHIFT)) & MC_ME_PRTN0_COFB0_STAT_BLOCK20_MASK)

#define MC_ME_PRTN0_COFB0_STAT_BLOCK21_MASK      (0x200000U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK21_SHIFT     (21U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK21_WIDTH     (1U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK21(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_STAT_BLOCK21_SHIFT)) & MC_ME_PRTN0_COFB0_STAT_BLOCK21_MASK)

#define MC_ME_PRTN0_COFB0_STAT_BLOCK22_MASK      (0x400000U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK22_SHIFT     (22U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK22_WIDTH     (1U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK22(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_STAT_BLOCK22_SHIFT)) & MC_ME_PRTN0_COFB0_STAT_BLOCK22_MASK)

#define MC_ME_PRTN0_COFB0_STAT_BLOCK23_MASK      (0x800000U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK23_SHIFT     (23U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK23_WIDTH     (1U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK23(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_STAT_BLOCK23_SHIFT)) & MC_ME_PRTN0_COFB0_STAT_BLOCK23_MASK)

#define MC_ME_PRTN0_COFB0_STAT_BLOCK24_MASK      (0x1000000U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK24_SHIFT     (24U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK24_WIDTH     (1U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK24(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_STAT_BLOCK24_SHIFT)) & MC_ME_PRTN0_COFB0_STAT_BLOCK24_MASK)

#define MC_ME_PRTN0_COFB0_STAT_BLOCK25_MASK      (0x2000000U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK25_SHIFT     (25U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK25_WIDTH     (1U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK25(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_STAT_BLOCK25_SHIFT)) & MC_ME_PRTN0_COFB0_STAT_BLOCK25_MASK)

#define MC_ME_PRTN0_COFB0_STAT_BLOCK26_MASK      (0x4000000U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK26_SHIFT     (26U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK26_WIDTH     (1U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK26(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_STAT_BLOCK26_SHIFT)) & MC_ME_PRTN0_COFB0_STAT_BLOCK26_MASK)

#define MC_ME_PRTN0_COFB0_STAT_BLOCK27_MASK      (0x8000000U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK27_SHIFT     (27U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK27_WIDTH     (1U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK27(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_STAT_BLOCK27_SHIFT)) & MC_ME_PRTN0_COFB0_STAT_BLOCK27_MASK)

#define MC_ME_PRTN0_COFB0_STAT_BLOCK28_MASK      (0x10000000U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK28_SHIFT     (28U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK28_WIDTH     (1U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK28(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_STAT_BLOCK28_SHIFT)) & MC_ME_PRTN0_COFB0_STAT_BLOCK28_MASK)

#define MC_ME_PRTN0_COFB0_STAT_BLOCK29_MASK      (0x20000000U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK29_SHIFT     (29U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK29_WIDTH     (1U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK29(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_STAT_BLOCK29_SHIFT)) & MC_ME_PRTN0_COFB0_STAT_BLOCK29_MASK)

#define MC_ME_PRTN0_COFB0_STAT_BLOCK30_MASK      (0x40000000U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK30_SHIFT     (30U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK30_WIDTH     (1U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK30(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_STAT_BLOCK30_SHIFT)) & MC_ME_PRTN0_COFB0_STAT_BLOCK30_MASK)

#define MC_ME_PRTN0_COFB0_STAT_BLOCK31_MASK      (0x80000000U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK31_SHIFT     (31U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK31_WIDTH     (1U)
#define MC_ME_PRTN0_COFB0_STAT_BLOCK31(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_STAT_BLOCK31_SHIFT)) & MC_ME_PRTN0_COFB0_STAT_BLOCK31_MASK)
/*! @} */

/*! @name PRTN0_COFB1_STAT - Partition 0 COFB Set 1 Clock Status Register */
/*! @{ */

#define MC_ME_PRTN0_COFB1_STAT_BLOCK32_MASK      (0x1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK32_SHIFT     (0U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK32_WIDTH     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK32(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_STAT_BLOCK32_SHIFT)) & MC_ME_PRTN0_COFB1_STAT_BLOCK32_MASK)

#define MC_ME_PRTN0_COFB1_STAT_BLOCK33_MASK      (0x2U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK33_SHIFT     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK33_WIDTH     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK33(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_STAT_BLOCK33_SHIFT)) & MC_ME_PRTN0_COFB1_STAT_BLOCK33_MASK)

#define MC_ME_PRTN0_COFB1_STAT_BLOCK34_MASK      (0x4U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK34_SHIFT     (2U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK34_WIDTH     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK34(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_STAT_BLOCK34_SHIFT)) & MC_ME_PRTN0_COFB1_STAT_BLOCK34_MASK)

#define MC_ME_PRTN0_COFB1_STAT_BLOCK35_MASK      (0x8U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK35_SHIFT     (3U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK35_WIDTH     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK35(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_STAT_BLOCK35_SHIFT)) & MC_ME_PRTN0_COFB1_STAT_BLOCK35_MASK)

#define MC_ME_PRTN0_COFB1_STAT_BLOCK36_MASK      (0x10U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK36_SHIFT     (4U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK36_WIDTH     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK36(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_STAT_BLOCK36_SHIFT)) & MC_ME_PRTN0_COFB1_STAT_BLOCK36_MASK)

