zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_ME.h
#define MC_ME_PRTN0_COFB1_STAT_BLOCK37_MASK      (0x20U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK37_SHIFT     (5U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK37_WIDTH     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK37(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_STAT_BLOCK37_SHIFT)) & MC_ME_PRTN0_COFB1_STAT_BLOCK37_MASK)

#define MC_ME_PRTN0_COFB1_STAT_BLOCK38_MASK      (0x40U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK38_SHIFT     (6U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK38_WIDTH     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK38(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_STAT_BLOCK38_SHIFT)) & MC_ME_PRTN0_COFB1_STAT_BLOCK38_MASK)

#define MC_ME_PRTN0_COFB1_STAT_BLOCK39_MASK      (0x80U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK39_SHIFT     (7U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK39_WIDTH     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK39(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_STAT_BLOCK39_SHIFT)) & MC_ME_PRTN0_COFB1_STAT_BLOCK39_MASK)

#define MC_ME_PRTN0_COFB1_STAT_BLOCK40_MASK      (0x100U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK40_SHIFT     (8U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK40_WIDTH     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK40(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_STAT_BLOCK40_SHIFT)) & MC_ME_PRTN0_COFB1_STAT_BLOCK40_MASK)

#define MC_ME_PRTN0_COFB1_STAT_BLOCK41_MASK      (0x200U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK41_SHIFT     (9U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK41_WIDTH     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK41(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_STAT_BLOCK41_SHIFT)) & MC_ME_PRTN0_COFB1_STAT_BLOCK41_MASK)

#define MC_ME_PRTN0_COFB1_STAT_BLOCK42_MASK      (0x400U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK42_SHIFT     (10U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK42_WIDTH     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK42(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_STAT_BLOCK42_SHIFT)) & MC_ME_PRTN0_COFB1_STAT_BLOCK42_MASK)

#define MC_ME_PRTN0_COFB1_STAT_BLOCK43_MASK      (0x800U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK43_SHIFT     (11U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK43_WIDTH     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK43(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_STAT_BLOCK43_SHIFT)) & MC_ME_PRTN0_COFB1_STAT_BLOCK43_MASK)

#define MC_ME_PRTN0_COFB1_STAT_BLOCK44_MASK      (0x1000U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK44_SHIFT     (12U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK44_WIDTH     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK44(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_STAT_BLOCK44_SHIFT)) & MC_ME_PRTN0_COFB1_STAT_BLOCK44_MASK)

#define MC_ME_PRTN0_COFB1_STAT_BLOCK45_MASK      (0x2000U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK45_SHIFT     (13U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK45_WIDTH     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK45(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_STAT_BLOCK45_SHIFT)) & MC_ME_PRTN0_COFB1_STAT_BLOCK45_MASK)

#define MC_ME_PRTN0_COFB1_STAT_BLOCK46_MASK      (0x4000U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK46_SHIFT     (14U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK46_WIDTH     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK46(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_STAT_BLOCK46_SHIFT)) & MC_ME_PRTN0_COFB1_STAT_BLOCK46_MASK)

#define MC_ME_PRTN0_COFB1_STAT_BLOCK47_MASK      (0x8000U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK47_SHIFT     (15U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK47_WIDTH     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK47(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_STAT_BLOCK47_SHIFT)) & MC_ME_PRTN0_COFB1_STAT_BLOCK47_MASK)

#define MC_ME_PRTN0_COFB1_STAT_BLOCK48_MASK      (0x10000U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK48_SHIFT     (16U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK48_WIDTH     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK48(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_STAT_BLOCK48_SHIFT)) & MC_ME_PRTN0_COFB1_STAT_BLOCK48_MASK)

#define MC_ME_PRTN0_COFB1_STAT_BLOCK49_MASK      (0x20000U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK49_SHIFT     (17U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK49_WIDTH     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK49(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_STAT_BLOCK49_SHIFT)) & MC_ME_PRTN0_COFB1_STAT_BLOCK49_MASK)

#define MC_ME_PRTN0_COFB1_STAT_BLOCK50_MASK      (0x40000U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK50_SHIFT     (18U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK50_WIDTH     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK50(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_STAT_BLOCK50_SHIFT)) & MC_ME_PRTN0_COFB1_STAT_BLOCK50_MASK)

#define MC_ME_PRTN0_COFB1_STAT_BLOCK51_MASK      (0x80000U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK51_SHIFT     (19U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK51_WIDTH     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK51(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_STAT_BLOCK51_SHIFT)) & MC_ME_PRTN0_COFB1_STAT_BLOCK51_MASK)

#define MC_ME_PRTN0_COFB1_STAT_BLOCK52_MASK      (0x100000U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK52_SHIFT     (20U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK52_WIDTH     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK52(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_STAT_BLOCK52_SHIFT)) & MC_ME_PRTN0_COFB1_STAT_BLOCK52_MASK)

#define MC_ME_PRTN0_COFB1_STAT_BLOCK53_MASK      (0x200000U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK53_SHIFT     (21U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK53_WIDTH     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK53(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_STAT_BLOCK53_SHIFT)) & MC_ME_PRTN0_COFB1_STAT_BLOCK53_MASK)

#define MC_ME_PRTN0_COFB1_STAT_BLOCK54_MASK      (0x400000U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK54_SHIFT     (22U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK54_WIDTH     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK54(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_STAT_BLOCK54_SHIFT)) & MC_ME_PRTN0_COFB1_STAT_BLOCK54_MASK)

#define MC_ME_PRTN0_COFB1_STAT_BLOCK55_MASK      (0x800000U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK55_SHIFT     (23U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK55_WIDTH     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK55(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_STAT_BLOCK55_SHIFT)) & MC_ME_PRTN0_COFB1_STAT_BLOCK55_MASK)

#define MC_ME_PRTN0_COFB1_STAT_BLOCK56_MASK      (0x1000000U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK56_SHIFT     (24U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK56_WIDTH     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK56(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_STAT_BLOCK56_SHIFT)) & MC_ME_PRTN0_COFB1_STAT_BLOCK56_MASK)

