zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_ME.h
#define MC_ME_PRTN0_COFB1_STAT_BLOCK57_MASK      (0x2000000U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK57_SHIFT     (25U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK57_WIDTH     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK57(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_STAT_BLOCK57_SHIFT)) & MC_ME_PRTN0_COFB1_STAT_BLOCK57_MASK)

#define MC_ME_PRTN0_COFB1_STAT_BLOCK58_MASK      (0x4000000U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK58_SHIFT     (26U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK58_WIDTH     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK58(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_STAT_BLOCK58_SHIFT)) & MC_ME_PRTN0_COFB1_STAT_BLOCK58_MASK)

#define MC_ME_PRTN0_COFB1_STAT_BLOCK59_MASK      (0x8000000U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK59_SHIFT     (27U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK59_WIDTH     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK59(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_STAT_BLOCK59_SHIFT)) & MC_ME_PRTN0_COFB1_STAT_BLOCK59_MASK)

#define MC_ME_PRTN0_COFB1_STAT_BLOCK60_MASK      (0x10000000U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK60_SHIFT     (28U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK60_WIDTH     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK60(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_STAT_BLOCK60_SHIFT)) & MC_ME_PRTN0_COFB1_STAT_BLOCK60_MASK)

#define MC_ME_PRTN0_COFB1_STAT_BLOCK61_MASK      (0x20000000U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK61_SHIFT     (29U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK61_WIDTH     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK61(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_STAT_BLOCK61_SHIFT)) & MC_ME_PRTN0_COFB1_STAT_BLOCK61_MASK)

#define MC_ME_PRTN0_COFB1_STAT_BLOCK62_MASK      (0x40000000U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK62_SHIFT     (30U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK62_WIDTH     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK62(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_STAT_BLOCK62_SHIFT)) & MC_ME_PRTN0_COFB1_STAT_BLOCK62_MASK)

#define MC_ME_PRTN0_COFB1_STAT_BLOCK63_MASK      (0x80000000U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK63_SHIFT     (31U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK63_WIDTH     (1U)
#define MC_ME_PRTN0_COFB1_STAT_BLOCK63(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_STAT_BLOCK63_SHIFT)) & MC_ME_PRTN0_COFB1_STAT_BLOCK63_MASK)
/*! @} */

/*! @name PRTN0_COFB2_STAT - Partition 0 COFB Set 2 Clock Status Register */
/*! @{ */

#define MC_ME_PRTN0_COFB2_STAT_BLOCK64_MASK      (0x1U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK64_SHIFT     (0U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK64_WIDTH     (1U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK64(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB2_STAT_BLOCK64_SHIFT)) & MC_ME_PRTN0_COFB2_STAT_BLOCK64_MASK)

#define MC_ME_PRTN0_COFB2_STAT_BLOCK65_MASK      (0x2U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK65_SHIFT     (1U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK65_WIDTH     (1U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK65(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB2_STAT_BLOCK65_SHIFT)) & MC_ME_PRTN0_COFB2_STAT_BLOCK65_MASK)

#define MC_ME_PRTN0_COFB2_STAT_BLOCK66_MASK      (0x4U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK66_SHIFT     (2U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK66_WIDTH     (1U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK66(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB2_STAT_BLOCK66_SHIFT)) & MC_ME_PRTN0_COFB2_STAT_BLOCK66_MASK)

#define MC_ME_PRTN0_COFB2_STAT_BLOCK67_MASK      (0x8U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK67_SHIFT     (3U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK67_WIDTH     (1U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK67(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB2_STAT_BLOCK67_SHIFT)) & MC_ME_PRTN0_COFB2_STAT_BLOCK67_MASK)

#define MC_ME_PRTN0_COFB2_STAT_BLOCK68_MASK      (0x10U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK68_SHIFT     (4U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK68_WIDTH     (1U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK68(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB2_STAT_BLOCK68_SHIFT)) & MC_ME_PRTN0_COFB2_STAT_BLOCK68_MASK)

#define MC_ME_PRTN0_COFB2_STAT_BLOCK69_MASK      (0x20U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK69_SHIFT     (5U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK69_WIDTH     (1U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK69(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB2_STAT_BLOCK69_SHIFT)) & MC_ME_PRTN0_COFB2_STAT_BLOCK69_MASK)

#define MC_ME_PRTN0_COFB2_STAT_BLOCK70_MASK      (0x40U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK70_SHIFT     (6U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK70_WIDTH     (1U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK70(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB2_STAT_BLOCK70_SHIFT)) & MC_ME_PRTN0_COFB2_STAT_BLOCK70_MASK)

#define MC_ME_PRTN0_COFB2_STAT_BLOCK71_MASK      (0x80U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK71_SHIFT     (7U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK71_WIDTH     (1U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK71(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB2_STAT_BLOCK71_SHIFT)) & MC_ME_PRTN0_COFB2_STAT_BLOCK71_MASK)

#define MC_ME_PRTN0_COFB2_STAT_BLOCK72_MASK      (0x100U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK72_SHIFT     (8U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK72_WIDTH     (1U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK72(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB2_STAT_BLOCK72_SHIFT)) & MC_ME_PRTN0_COFB2_STAT_BLOCK72_MASK)

#define MC_ME_PRTN0_COFB2_STAT_BLOCK73_MASK      (0x200U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK73_SHIFT     (9U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK73_WIDTH     (1U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK73(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB2_STAT_BLOCK73_SHIFT)) & MC_ME_PRTN0_COFB2_STAT_BLOCK73_MASK)

#define MC_ME_PRTN0_COFB2_STAT_BLOCK74_MASK      (0x400U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK74_SHIFT     (10U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK74_WIDTH     (1U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK74(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB2_STAT_BLOCK74_SHIFT)) & MC_ME_PRTN0_COFB2_STAT_BLOCK74_MASK)

#define MC_ME_PRTN0_COFB2_STAT_BLOCK75_MASK      (0x800U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK75_SHIFT     (11U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK75_WIDTH     (1U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK75(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB2_STAT_BLOCK75_SHIFT)) & MC_ME_PRTN0_COFB2_STAT_BLOCK75_MASK)

#define MC_ME_PRTN0_COFB2_STAT_BLOCK76_MASK      (0x1000U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK76_SHIFT     (12U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK76_WIDTH     (1U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK76(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB2_STAT_BLOCK76_SHIFT)) & MC_ME_PRTN0_COFB2_STAT_BLOCK76_MASK)

#define MC_ME_PRTN0_COFB2_STAT_BLOCK77_MASK      (0x2000U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK77_SHIFT     (13U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK77_WIDTH     (1U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK77(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB2_STAT_BLOCK77_SHIFT)) & MC_ME_PRTN0_COFB2_STAT_BLOCK77_MASK)

#define MC_ME_PRTN0_COFB2_STAT_BLOCK78_MASK      (0x4000U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK78_SHIFT     (14U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK78_WIDTH     (1U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK78(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB2_STAT_BLOCK78_SHIFT)) & MC_ME_PRTN0_COFB2_STAT_BLOCK78_MASK)

#define MC_ME_PRTN0_COFB2_STAT_BLOCK79_MASK      (0x8000U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK79_SHIFT     (15U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK79_WIDTH     (1U)
#define MC_ME_PRTN0_COFB2_STAT_BLOCK79(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB2_STAT_BLOCK79_SHIFT)) & MC_ME_PRTN0_COFB2_STAT_BLOCK79_MASK)

