zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_ME.h
#define MC_ME_PRTN0_COFB3_STAT_BLOCK99_MASK      (0x8U)
#define MC_ME_PRTN0_COFB3_STAT_BLOCK99_SHIFT     (3U)
#define MC_ME_PRTN0_COFB3_STAT_BLOCK99_WIDTH     (1U)
#define MC_ME_PRTN0_COFB3_STAT_BLOCK99(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB3_STAT_BLOCK99_SHIFT)) & MC_ME_PRTN0_COFB3_STAT_BLOCK99_MASK)

#define MC_ME_PRTN0_COFB3_STAT_BLOCK100_MASK     (0x10U)
#define MC_ME_PRTN0_COFB3_STAT_BLOCK100_SHIFT    (4U)
#define MC_ME_PRTN0_COFB3_STAT_BLOCK100_WIDTH    (1U)
#define MC_ME_PRTN0_COFB3_STAT_BLOCK100(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB3_STAT_BLOCK100_SHIFT)) & MC_ME_PRTN0_COFB3_STAT_BLOCK100_MASK)

#define MC_ME_PRTN0_COFB3_STAT_BLOCK101_MASK     (0x20U)
#define MC_ME_PRTN0_COFB3_STAT_BLOCK101_SHIFT    (5U)
#define MC_ME_PRTN0_COFB3_STAT_BLOCK101_WIDTH    (1U)
#define MC_ME_PRTN0_COFB3_STAT_BLOCK101(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB3_STAT_BLOCK101_SHIFT)) & MC_ME_PRTN0_COFB3_STAT_BLOCK101_MASK)

#define MC_ME_PRTN0_COFB3_STAT_BLOCK102_MASK     (0x40U)
#define MC_ME_PRTN0_COFB3_STAT_BLOCK102_SHIFT    (6U)
#define MC_ME_PRTN0_COFB3_STAT_BLOCK102_WIDTH    (1U)
#define MC_ME_PRTN0_COFB3_STAT_BLOCK102(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB3_STAT_BLOCK102_SHIFT)) & MC_ME_PRTN0_COFB3_STAT_BLOCK102_MASK)

#define MC_ME_PRTN0_COFB3_STAT_BLOCK103_MASK     (0x80U)
#define MC_ME_PRTN0_COFB3_STAT_BLOCK103_SHIFT    (7U)
#define MC_ME_PRTN0_COFB3_STAT_BLOCK103_WIDTH    (1U)
#define MC_ME_PRTN0_COFB3_STAT_BLOCK103(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB3_STAT_BLOCK103_SHIFT)) & MC_ME_PRTN0_COFB3_STAT_BLOCK103_MASK)

#define MC_ME_PRTN0_COFB3_STAT_BLOCK104_MASK     (0x100U)
#define MC_ME_PRTN0_COFB3_STAT_BLOCK104_SHIFT    (8U)
#define MC_ME_PRTN0_COFB3_STAT_BLOCK104_WIDTH    (1U)
#define MC_ME_PRTN0_COFB3_STAT_BLOCK104(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB3_STAT_BLOCK104_SHIFT)) & MC_ME_PRTN0_COFB3_STAT_BLOCK104_MASK)

#define MC_ME_PRTN0_COFB3_STAT_BLOCK105_MASK     (0x200U)
#define MC_ME_PRTN0_COFB3_STAT_BLOCK105_SHIFT    (9U)
#define MC_ME_PRTN0_COFB3_STAT_BLOCK105_WIDTH    (1U)
#define MC_ME_PRTN0_COFB3_STAT_BLOCK105(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB3_STAT_BLOCK105_SHIFT)) & MC_ME_PRTN0_COFB3_STAT_BLOCK105_MASK)

#define MC_ME_PRTN0_COFB3_STAT_BLOCK106_MASK     (0x400U)
#define MC_ME_PRTN0_COFB3_STAT_BLOCK106_SHIFT    (10U)
#define MC_ME_PRTN0_COFB3_STAT_BLOCK106_WIDTH    (1U)
#define MC_ME_PRTN0_COFB3_STAT_BLOCK106(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB3_STAT_BLOCK106_SHIFT)) & MC_ME_PRTN0_COFB3_STAT_BLOCK106_MASK)

#define MC_ME_PRTN0_COFB3_STAT_BLOCK107_MASK     (0x800U)
#define MC_ME_PRTN0_COFB3_STAT_BLOCK107_SHIFT    (11U)
#define MC_ME_PRTN0_COFB3_STAT_BLOCK107_WIDTH    (1U)
#define MC_ME_PRTN0_COFB3_STAT_BLOCK107(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB3_STAT_BLOCK107_SHIFT)) & MC_ME_PRTN0_COFB3_STAT_BLOCK107_MASK)
/*! @} */

/*! @name PRTN0_COFB0_CLKEN - Partition 0 COFB Set 0 Clock Enable Register */
/*! @{ */

#define MC_ME_PRTN0_COFB0_CLKEN_REQ1_MASK        (0x2U)
#define MC_ME_PRTN0_COFB0_CLKEN_REQ1_SHIFT       (1U)
#define MC_ME_PRTN0_COFB0_CLKEN_REQ1_WIDTH       (1U)
#define MC_ME_PRTN0_COFB0_CLKEN_REQ1(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_CLKEN_REQ1_SHIFT)) & MC_ME_PRTN0_COFB0_CLKEN_REQ1_MASK)

#define MC_ME_PRTN0_COFB0_CLKEN_REQ2_MASK        (0x4U)
#define MC_ME_PRTN0_COFB0_CLKEN_REQ2_SHIFT       (2U)
#define MC_ME_PRTN0_COFB0_CLKEN_REQ2_WIDTH       (1U)
#define MC_ME_PRTN0_COFB0_CLKEN_REQ2(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_CLKEN_REQ2_SHIFT)) & MC_ME_PRTN0_COFB0_CLKEN_REQ2_MASK)

#define MC_ME_PRTN0_COFB0_CLKEN_REQ3_MASK        (0x8U)
#define MC_ME_PRTN0_COFB0_CLKEN_REQ3_SHIFT       (3U)
#define MC_ME_PRTN0_COFB0_CLKEN_REQ3_WIDTH       (1U)
#define MC_ME_PRTN0_COFB0_CLKEN_REQ3(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_CLKEN_REQ3_SHIFT)) & MC_ME_PRTN0_COFB0_CLKEN_REQ3_MASK)

#define MC_ME_PRTN0_COFB0_CLKEN_REQ4_MASK        (0x10U)
#define MC_ME_PRTN0_COFB0_CLKEN_REQ4_SHIFT       (4U)
#define MC_ME_PRTN0_COFB0_CLKEN_REQ4_WIDTH       (1U)
#define MC_ME_PRTN0_COFB0_CLKEN_REQ4(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_CLKEN_REQ4_SHIFT)) & MC_ME_PRTN0_COFB0_CLKEN_REQ4_MASK)

#define MC_ME_PRTN0_COFB0_CLKEN_REQ5_MASK        (0x20U)
#define MC_ME_PRTN0_COFB0_CLKEN_REQ5_SHIFT       (5U)
#define MC_ME_PRTN0_COFB0_CLKEN_REQ5_WIDTH       (1U)
#define MC_ME_PRTN0_COFB0_CLKEN_REQ5(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_CLKEN_REQ5_SHIFT)) & MC_ME_PRTN0_COFB0_CLKEN_REQ5_MASK)

#define MC_ME_PRTN0_COFB0_CLKEN_REQ6_MASK        (0x40U)
#define MC_ME_PRTN0_COFB0_CLKEN_REQ6_SHIFT       (6U)
#define MC_ME_PRTN0_COFB0_CLKEN_REQ6_WIDTH       (1U)
#define MC_ME_PRTN0_COFB0_CLKEN_REQ6(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_CLKEN_REQ6_SHIFT)) & MC_ME_PRTN0_COFB0_CLKEN_REQ6_MASK)

#define MC_ME_PRTN0_COFB0_CLKEN_REQ7_MASK        (0x80U)
#define MC_ME_PRTN0_COFB0_CLKEN_REQ7_SHIFT       (7U)
#define MC_ME_PRTN0_COFB0_CLKEN_REQ7_WIDTH       (1U)
#define MC_ME_PRTN0_COFB0_CLKEN_REQ7(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_CLKEN_REQ7_SHIFT)) & MC_ME_PRTN0_COFB0_CLKEN_REQ7_MASK)

#define MC_ME_PRTN0_COFB0_CLKEN_REQ8_MASK        (0x100U)
#define MC_ME_PRTN0_COFB0_CLKEN_REQ8_SHIFT       (8U)
#define MC_ME_PRTN0_COFB0_CLKEN_REQ8_WIDTH       (1U)
#define MC_ME_PRTN0_COFB0_CLKEN_REQ8(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_CLKEN_REQ8_SHIFT)) & MC_ME_PRTN0_COFB0_CLKEN_REQ8_MASK)

#define MC_ME_PRTN0_COFB0_CLKEN_REQ9_MASK        (0x200U)
#define MC_ME_PRTN0_COFB0_CLKEN_REQ9_SHIFT       (9U)
#define MC_ME_PRTN0_COFB0_CLKEN_REQ9_WIDTH       (1U)
#define MC_ME_PRTN0_COFB0_CLKEN_REQ9(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_CLKEN_REQ9_SHIFT)) & MC_ME_PRTN0_COFB0_CLKEN_REQ9_MASK)

#define MC_ME_PRTN0_COFB0_CLKEN_REQ10_MASK       (0x400U)
#define MC_ME_PRTN0_COFB0_CLKEN_REQ10_SHIFT      (10U)
#define MC_ME_PRTN0_COFB0_CLKEN_REQ10_WIDTH      (1U)
#define MC_ME_PRTN0_COFB0_CLKEN_REQ10(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB0_CLKEN_REQ10_SHIFT)) & MC_ME_PRTN0_COFB0_CLKEN_REQ10_MASK)

