zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_ME.h
#define MC_ME_PRTN0_COFB1_CLKEN_REQ40_MASK       (0x100U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ40_SHIFT      (8U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ40_WIDTH      (1U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ40(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_CLKEN_REQ40_SHIFT)) & MC_ME_PRTN0_COFB1_CLKEN_REQ40_MASK)

#define MC_ME_PRTN0_COFB1_CLKEN_REQ41_MASK       (0x200U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ41_SHIFT      (9U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ41_WIDTH      (1U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ41(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_CLKEN_REQ41_SHIFT)) & MC_ME_PRTN0_COFB1_CLKEN_REQ41_MASK)

#define MC_ME_PRTN0_COFB1_CLKEN_REQ46_MASK       (0x4000U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ46_SHIFT      (14U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ46_WIDTH      (1U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ46(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_CLKEN_REQ46_SHIFT)) & MC_ME_PRTN0_COFB1_CLKEN_REQ46_MASK)

#define MC_ME_PRTN0_COFB1_CLKEN_REQ47_MASK       (0x8000U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ47_SHIFT      (15U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ47_WIDTH      (1U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ47(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_CLKEN_REQ47_SHIFT)) & MC_ME_PRTN0_COFB1_CLKEN_REQ47_MASK)

#define MC_ME_PRTN0_COFB1_CLKEN_REQ48_MASK       (0x10000U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ48_SHIFT      (16U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ48_WIDTH      (1U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ48(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_CLKEN_REQ48_SHIFT)) & MC_ME_PRTN0_COFB1_CLKEN_REQ48_MASK)

#define MC_ME_PRTN0_COFB1_CLKEN_REQ49_MASK       (0x20000U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ49_SHIFT      (17U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ49_WIDTH      (1U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ49(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_CLKEN_REQ49_SHIFT)) & MC_ME_PRTN0_COFB1_CLKEN_REQ49_MASK)

#define MC_ME_PRTN0_COFB1_CLKEN_REQ53_MASK       (0x200000U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ53_SHIFT      (21U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ53_WIDTH      (1U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ53(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_CLKEN_REQ53_SHIFT)) & MC_ME_PRTN0_COFB1_CLKEN_REQ53_MASK)

#define MC_ME_PRTN0_COFB1_CLKEN_REQ54_MASK       (0x400000U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ54_SHIFT      (22U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ54_WIDTH      (1U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ54(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_CLKEN_REQ54_SHIFT)) & MC_ME_PRTN0_COFB1_CLKEN_REQ54_MASK)

#define MC_ME_PRTN0_COFB1_CLKEN_REQ55_MASK       (0x800000U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ55_SHIFT      (23U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ55_WIDTH      (1U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ55(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_CLKEN_REQ55_SHIFT)) & MC_ME_PRTN0_COFB1_CLKEN_REQ55_MASK)

#define MC_ME_PRTN0_COFB1_CLKEN_REQ56_MASK       (0x1000000U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ56_SHIFT      (24U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ56_WIDTH      (1U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ56(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_CLKEN_REQ56_SHIFT)) & MC_ME_PRTN0_COFB1_CLKEN_REQ56_MASK)

#define MC_ME_PRTN0_COFB1_CLKEN_REQ57_MASK       (0x2000000U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ57_SHIFT      (25U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ57_WIDTH      (1U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ57(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_CLKEN_REQ57_SHIFT)) & MC_ME_PRTN0_COFB1_CLKEN_REQ57_MASK)

#define MC_ME_PRTN0_COFB1_CLKEN_REQ60_MASK       (0x10000000U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ60_SHIFT      (28U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ60_WIDTH      (1U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ60(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_CLKEN_REQ60_SHIFT)) & MC_ME_PRTN0_COFB1_CLKEN_REQ60_MASK)

#define MC_ME_PRTN0_COFB1_CLKEN_REQ61_MASK       (0x20000000U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ61_SHIFT      (29U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ61_WIDTH      (1U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ61(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_CLKEN_REQ61_SHIFT)) & MC_ME_PRTN0_COFB1_CLKEN_REQ61_MASK)

#define MC_ME_PRTN0_COFB1_CLKEN_REQ62_MASK       (0x40000000U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ62_SHIFT      (30U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ62_WIDTH      (1U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ62(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_CLKEN_REQ62_SHIFT)) & MC_ME_PRTN0_COFB1_CLKEN_REQ62_MASK)

#define MC_ME_PRTN0_COFB1_CLKEN_REQ63_MASK       (0x80000000U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ63_SHIFT      (31U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ63_WIDTH      (1U)
#define MC_ME_PRTN0_COFB1_CLKEN_REQ63(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB1_CLKEN_REQ63_SHIFT)) & MC_ME_PRTN0_COFB1_CLKEN_REQ63_MASK)
/*! @} */

/*! @name PRTN0_COFB2_CLKEN - Partition 0 COFB Set 2 Clock Enable Register */
/*! @{ */

#define MC_ME_PRTN0_COFB2_CLKEN_REQ64_MASK       (0x1U)
#define MC_ME_PRTN0_COFB2_CLKEN_REQ64_SHIFT      (0U)
#define MC_ME_PRTN0_COFB2_CLKEN_REQ64_WIDTH      (1U)
#define MC_ME_PRTN0_COFB2_CLKEN_REQ64(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB2_CLKEN_REQ64_SHIFT)) & MC_ME_PRTN0_COFB2_CLKEN_REQ64_MASK)

#define MC_ME_PRTN0_COFB2_CLKEN_REQ65_MASK       (0x2U)
#define MC_ME_PRTN0_COFB2_CLKEN_REQ65_SHIFT      (1U)
#define MC_ME_PRTN0_COFB2_CLKEN_REQ65_WIDTH      (1U)
#define MC_ME_PRTN0_COFB2_CLKEN_REQ65(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB2_CLKEN_REQ65_SHIFT)) & MC_ME_PRTN0_COFB2_CLKEN_REQ65_MASK)

#define MC_ME_PRTN0_COFB2_CLKEN_REQ66_MASK       (0x4U)
#define MC_ME_PRTN0_COFB2_CLKEN_REQ66_SHIFT      (2U)
#define MC_ME_PRTN0_COFB2_CLKEN_REQ66_WIDTH      (1U)
#define MC_ME_PRTN0_COFB2_CLKEN_REQ66(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB2_CLKEN_REQ66_SHIFT)) & MC_ME_PRTN0_COFB2_CLKEN_REQ66_MASK)

#define MC_ME_PRTN0_COFB2_CLKEN_REQ67_MASK       (0x8U)
#define MC_ME_PRTN0_COFB2_CLKEN_REQ67_SHIFT      (3U)
#define MC_ME_PRTN0_COFB2_CLKEN_REQ67_WIDTH      (1U)
#define MC_ME_PRTN0_COFB2_CLKEN_REQ67(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB2_CLKEN_REQ67_SHIFT)) & MC_ME_PRTN0_COFB2_CLKEN_REQ67_MASK)

