zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_ME.h
#define MC_ME_PRTN0_COFB2_CLKEN_REQ94_MASK       (0x40000000U)
#define MC_ME_PRTN0_COFB2_CLKEN_REQ94_SHIFT      (30U)
#define MC_ME_PRTN0_COFB2_CLKEN_REQ94_WIDTH      (1U)
#define MC_ME_PRTN0_COFB2_CLKEN_REQ94(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB2_CLKEN_REQ94_SHIFT)) & MC_ME_PRTN0_COFB2_CLKEN_REQ94_MASK)

#define MC_ME_PRTN0_COFB2_CLKEN_REQ95_MASK       (0x80000000U)
#define MC_ME_PRTN0_COFB2_CLKEN_REQ95_SHIFT      (31U)
#define MC_ME_PRTN0_COFB2_CLKEN_REQ95_WIDTH      (1U)
#define MC_ME_PRTN0_COFB2_CLKEN_REQ95(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB2_CLKEN_REQ95_SHIFT)) & MC_ME_PRTN0_COFB2_CLKEN_REQ95_MASK)
/*! @} */

/*! @name PRTN0_COFB3_CLKEN - Partition 0 COFB Set 3 Clock Enable Register */
/*! @{ */

#define MC_ME_PRTN0_COFB3_CLKEN_REQ96_MASK       (0x1U)
#define MC_ME_PRTN0_COFB3_CLKEN_REQ96_SHIFT      (0U)
#define MC_ME_PRTN0_COFB3_CLKEN_REQ96_WIDTH      (1U)
#define MC_ME_PRTN0_COFB3_CLKEN_REQ96(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB3_CLKEN_REQ96_SHIFT)) & MC_ME_PRTN0_COFB3_CLKEN_REQ96_MASK)

#define MC_ME_PRTN0_COFB3_CLKEN_REQ97_MASK       (0x2U)
#define MC_ME_PRTN0_COFB3_CLKEN_REQ97_SHIFT      (1U)
#define MC_ME_PRTN0_COFB3_CLKEN_REQ97_WIDTH      (1U)
#define MC_ME_PRTN0_COFB3_CLKEN_REQ97(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB3_CLKEN_REQ97_SHIFT)) & MC_ME_PRTN0_COFB3_CLKEN_REQ97_MASK)

#define MC_ME_PRTN0_COFB3_CLKEN_REQ98_MASK       (0x4U)
#define MC_ME_PRTN0_COFB3_CLKEN_REQ98_SHIFT      (2U)
#define MC_ME_PRTN0_COFB3_CLKEN_REQ98_WIDTH      (1U)
#define MC_ME_PRTN0_COFB3_CLKEN_REQ98(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB3_CLKEN_REQ98_SHIFT)) & MC_ME_PRTN0_COFB3_CLKEN_REQ98_MASK)

#define MC_ME_PRTN0_COFB3_CLKEN_REQ99_MASK       (0x8U)
#define MC_ME_PRTN0_COFB3_CLKEN_REQ99_SHIFT      (3U)
#define MC_ME_PRTN0_COFB3_CLKEN_REQ99_WIDTH      (1U)
#define MC_ME_PRTN0_COFB3_CLKEN_REQ99(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB3_CLKEN_REQ99_SHIFT)) & MC_ME_PRTN0_COFB3_CLKEN_REQ99_MASK)

#define MC_ME_PRTN0_COFB3_CLKEN_REQ100_MASK      (0x10U)
#define MC_ME_PRTN0_COFB3_CLKEN_REQ100_SHIFT     (4U)
#define MC_ME_PRTN0_COFB3_CLKEN_REQ100_WIDTH     (1U)
#define MC_ME_PRTN0_COFB3_CLKEN_REQ100(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB3_CLKEN_REQ100_SHIFT)) & MC_ME_PRTN0_COFB3_CLKEN_REQ100_MASK)

#define MC_ME_PRTN0_COFB3_CLKEN_REQ106_MASK      (0x400U)
#define MC_ME_PRTN0_COFB3_CLKEN_REQ106_SHIFT     (10U)
#define MC_ME_PRTN0_COFB3_CLKEN_REQ106_WIDTH     (1U)
#define MC_ME_PRTN0_COFB3_CLKEN_REQ106(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_COFB3_CLKEN_REQ106_SHIFT)) & MC_ME_PRTN0_COFB3_CLKEN_REQ106_MASK)
/*! @} */

/*! @name PRTN0_CORE0_PCONF - Partition 0 Core 0 Process Configuration Register */
/*! @{ */

#define MC_ME_PRTN0_CORE0_PCONF_CCE_MASK         (0x1U)
#define MC_ME_PRTN0_CORE0_PCONF_CCE_SHIFT        (0U)
#define MC_ME_PRTN0_CORE0_PCONF_CCE_WIDTH        (1U)
#define MC_ME_PRTN0_CORE0_PCONF_CCE(x)           (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_CORE0_PCONF_CCE_SHIFT)) & MC_ME_PRTN0_CORE0_PCONF_CCE_MASK)
/*! @} */

/*! @name PRTN0_CORE0_PUPD - Partition 0 Core 0 Process Update Register */
/*! @{ */

#define MC_ME_PRTN0_CORE0_PUPD_CCUPD_MASK        (0x1U)
#define MC_ME_PRTN0_CORE0_PUPD_CCUPD_SHIFT       (0U)
#define MC_ME_PRTN0_CORE0_PUPD_CCUPD_WIDTH       (1U)
#define MC_ME_PRTN0_CORE0_PUPD_CCUPD(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_CORE0_PUPD_CCUPD_SHIFT)) & MC_ME_PRTN0_CORE0_PUPD_CCUPD_MASK)
/*! @} */

/*! @name PRTN0_CORE0_STAT - Partition 0 Core 0 Status Register */
/*! @{ */

#define MC_ME_PRTN0_CORE0_STAT_CCS_MASK          (0x1U)
#define MC_ME_PRTN0_CORE0_STAT_CCS_SHIFT         (0U)
#define MC_ME_PRTN0_CORE0_STAT_CCS_WIDTH         (1U)
#define MC_ME_PRTN0_CORE0_STAT_CCS(x)            (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_CORE0_STAT_CCS_SHIFT)) & MC_ME_PRTN0_CORE0_STAT_CCS_MASK)

#define MC_ME_PRTN0_CORE0_STAT_WFI_MASK          (0x80000000U)
#define MC_ME_PRTN0_CORE0_STAT_WFI_SHIFT         (31U)
#define MC_ME_PRTN0_CORE0_STAT_WFI_WIDTH         (1U)
#define MC_ME_PRTN0_CORE0_STAT_WFI(x)            (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_CORE0_STAT_WFI_SHIFT)) & MC_ME_PRTN0_CORE0_STAT_WFI_MASK)
/*! @} */

/*! @name PRTN0_CORE0_ADDR - Partition 0 Core 0 Address Register */
/*! @{ */

#define MC_ME_PRTN0_CORE0_ADDR_ADDR_MASK         (0xFFFFFFFCU)
#define MC_ME_PRTN0_CORE0_ADDR_ADDR_SHIFT        (2U)
#define MC_ME_PRTN0_CORE0_ADDR_ADDR_WIDTH        (30U)
#define MC_ME_PRTN0_CORE0_ADDR_ADDR(x)           (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_CORE0_ADDR_ADDR_SHIFT)) & MC_ME_PRTN0_CORE0_ADDR_ADDR_MASK)
/*! @} */

/*! @name PRTN0_CORE1_PCONF - Partition 0 Core 1 Process Configuration Register */
/*! @{ */

#define MC_ME_PRTN0_CORE1_PCONF_CCE_MASK         (0x1U)
#define MC_ME_PRTN0_CORE1_PCONF_CCE_SHIFT        (0U)
#define MC_ME_PRTN0_CORE1_PCONF_CCE_WIDTH        (1U)
#define MC_ME_PRTN0_CORE1_PCONF_CCE(x)           (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_CORE1_PCONF_CCE_SHIFT)) & MC_ME_PRTN0_CORE1_PCONF_CCE_MASK)
/*! @} */

/*! @name PRTN0_CORE1_PUPD - Partition 0 Core 1 Process Update Register */
/*! @{ */

#define MC_ME_PRTN0_CORE1_PUPD_CCUPD_MASK        (0x1U)
#define MC_ME_PRTN0_CORE1_PUPD_CCUPD_SHIFT       (0U)
#define MC_ME_PRTN0_CORE1_PUPD_CCUPD_WIDTH       (1U)
#define MC_ME_PRTN0_CORE1_PUPD_CCUPD(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_CORE1_PUPD_CCUPD_SHIFT)) & MC_ME_PRTN0_CORE1_PUPD_CCUPD_MASK)
/*! @} */

/*! @name PRTN0_CORE1_STAT - Partition 0 Core 1 Status Register */
/*! @{ */

#define MC_ME_PRTN0_CORE1_STAT_CCS_MASK          (0x1U)
#define MC_ME_PRTN0_CORE1_STAT_CCS_SHIFT         (0U)
#define MC_ME_PRTN0_CORE1_STAT_CCS_WIDTH         (1U)
#define MC_ME_PRTN0_CORE1_STAT_CCS(x)            (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_CORE1_STAT_CCS_SHIFT)) & MC_ME_PRTN0_CORE1_STAT_CCS_MASK)

#define MC_ME_PRTN0_CORE1_STAT_WFI_MASK          (0x80000000U)
#define MC_ME_PRTN0_CORE1_STAT_WFI_SHIFT         (31U)
#define MC_ME_PRTN0_CORE1_STAT_WFI_WIDTH         (1U)
#define MC_ME_PRTN0_CORE1_STAT_WFI(x)            (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_CORE1_STAT_WFI_SHIFT)) & MC_ME_PRTN0_CORE1_STAT_WFI_MASK)
/*! @} */

/*! @name PRTN0_CORE1_ADDR - Partition 0 Core 1 Address Register */
/*! @{ */

#define MC_ME_PRTN0_CORE1_ADDR_ADDR_MASK         (0xFFFFFFFCU)
#define MC_ME_PRTN0_CORE1_ADDR_ADDR_SHIFT        (2U)
#define MC_ME_PRTN0_CORE1_ADDR_ADDR_WIDTH        (30U)
#define MC_ME_PRTN0_CORE1_ADDR_ADDR(x)           (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_CORE1_ADDR_ADDR_SHIFT)) & MC_ME_PRTN0_CORE1_ADDR_ADDR_MASK)
/*! @} */

/*! @name PRTN0_CORE2_PCONF - Partition 0 Core 2 Process Configuration Register */
/*! @{ */

#define MC_ME_PRTN0_CORE2_PCONF_CCE_MASK         (0x1U)
#define MC_ME_PRTN0_CORE2_PCONF_CCE_SHIFT        (0U)
#define MC_ME_PRTN0_CORE2_PCONF_CCE_WIDTH        (1U)
#define MC_ME_PRTN0_CORE2_PCONF_CCE(x)           (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_CORE2_PCONF_CCE_SHIFT)) & MC_ME_PRTN0_CORE2_PCONF_CCE_MASK)
/*! @} */

/*! @name PRTN0_CORE2_PUPD - Partition 0 Core 2 Process Update Register */
/*! @{ */

#define MC_ME_PRTN0_CORE2_PUPD_CCUPD_MASK        (0x1U)
#define MC_ME_PRTN0_CORE2_PUPD_CCUPD_SHIFT       (0U)
#define MC_ME_PRTN0_CORE2_PUPD_CCUPD_WIDTH       (1U)
#define MC_ME_PRTN0_CORE2_PUPD_CCUPD(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_CORE2_PUPD_CCUPD_SHIFT)) & MC_ME_PRTN0_CORE2_PUPD_CCUPD_MASK)
/*! @} */

