zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_ME.h
#define MC_ME_PRTN0_CORE5_STAT_CCS_MASK          (0x1U)
#define MC_ME_PRTN0_CORE5_STAT_CCS_SHIFT         (0U)
#define MC_ME_PRTN0_CORE5_STAT_CCS_WIDTH         (1U)
#define MC_ME_PRTN0_CORE5_STAT_CCS(x)            (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_CORE5_STAT_CCS_SHIFT)) & MC_ME_PRTN0_CORE5_STAT_CCS_MASK)

#define MC_ME_PRTN0_CORE5_STAT_WFI_MASK          (0x80000000U)
#define MC_ME_PRTN0_CORE5_STAT_WFI_SHIFT         (31U)
#define MC_ME_PRTN0_CORE5_STAT_WFI_WIDTH         (1U)
#define MC_ME_PRTN0_CORE5_STAT_WFI(x)            (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_CORE5_STAT_WFI_SHIFT)) & MC_ME_PRTN0_CORE5_STAT_WFI_MASK)
/*! @} */

/*! @name PRTN0_CORE5_ADDR - Partition 0 Core 5 Address Register */
/*! @{ */

#define MC_ME_PRTN0_CORE5_ADDR_ADDR_MASK         (0xFFFFFFFCU)
#define MC_ME_PRTN0_CORE5_ADDR_ADDR_SHIFT        (2U)
#define MC_ME_PRTN0_CORE5_ADDR_ADDR_WIDTH        (30U)
#define MC_ME_PRTN0_CORE5_ADDR_ADDR(x)           (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_CORE5_ADDR_ADDR_SHIFT)) & MC_ME_PRTN0_CORE5_ADDR_ADDR_MASK)
/*! @} */

/*! @name PRTN0_CORE6_STAT - Partition 0 Core 6 Status Register */
/*! @{ */

#define MC_ME_PRTN0_CORE6_STAT_CCS_MASK          (0x1U)
#define MC_ME_PRTN0_CORE6_STAT_CCS_SHIFT         (0U)
#define MC_ME_PRTN0_CORE6_STAT_CCS_WIDTH         (1U)
#define MC_ME_PRTN0_CORE6_STAT_CCS(x)            (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_CORE6_STAT_CCS_SHIFT)) & MC_ME_PRTN0_CORE6_STAT_CCS_MASK)

#define MC_ME_PRTN0_CORE6_STAT_WFI_MASK          (0x80000000U)
#define MC_ME_PRTN0_CORE6_STAT_WFI_SHIFT         (31U)
#define MC_ME_PRTN0_CORE6_STAT_WFI_WIDTH         (1U)
#define MC_ME_PRTN0_CORE6_STAT_WFI(x)            (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_CORE6_STAT_WFI_SHIFT)) & MC_ME_PRTN0_CORE6_STAT_WFI_MASK)
/*! @} */

/*! @name PRTN0_CORE6_ADDR - Partition 0 Core 6 Address Register */
/*! @{ */

#define MC_ME_PRTN0_CORE6_ADDR_ADDR_MASK         (0xFFFFFFFCU)
#define MC_ME_PRTN0_CORE6_ADDR_ADDR_SHIFT        (2U)
#define MC_ME_PRTN0_CORE6_ADDR_ADDR_WIDTH        (30U)
#define MC_ME_PRTN0_CORE6_ADDR_ADDR(x)           (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_CORE6_ADDR_ADDR_SHIFT)) & MC_ME_PRTN0_CORE6_ADDR_ADDR_MASK)
/*! @} */

/*! @name PRTN0_CORE7_PCONF - Partition 0 Core 7 Process Configuration Register */
/*! @{ */

#define MC_ME_PRTN0_CORE7_PCONF_CCE_MASK         (0x1U)
#define MC_ME_PRTN0_CORE7_PCONF_CCE_SHIFT        (0U)
#define MC_ME_PRTN0_CORE7_PCONF_CCE_WIDTH        (1U)
#define MC_ME_PRTN0_CORE7_PCONF_CCE(x)           (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_CORE7_PCONF_CCE_SHIFT)) & MC_ME_PRTN0_CORE7_PCONF_CCE_MASK)
/*! @} */

/*! @name PRTN0_CORE7_PUPD - Partition 0 Core 7 Process Update Register */
/*! @{ */

#define MC_ME_PRTN0_CORE7_PUPD_CCUPD_MASK        (0x1U)
#define MC_ME_PRTN0_CORE7_PUPD_CCUPD_SHIFT       (0U)
#define MC_ME_PRTN0_CORE7_PUPD_CCUPD_WIDTH       (1U)
#define MC_ME_PRTN0_CORE7_PUPD_CCUPD(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_CORE7_PUPD_CCUPD_SHIFT)) & MC_ME_PRTN0_CORE7_PUPD_CCUPD_MASK)
/*! @} */

/*! @name PRTN0_CORE7_STAT - Partition 0 Core 7 Status Register */
/*! @{ */

#define MC_ME_PRTN0_CORE7_STAT_CCS_MASK          (0x1U)
#define MC_ME_PRTN0_CORE7_STAT_CCS_SHIFT         (0U)
#define MC_ME_PRTN0_CORE7_STAT_CCS_WIDTH         (1U)
#define MC_ME_PRTN0_CORE7_STAT_CCS(x)            (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_CORE7_STAT_CCS_SHIFT)) & MC_ME_PRTN0_CORE7_STAT_CCS_MASK)

#define MC_ME_PRTN0_CORE7_STAT_WFI_MASK          (0x80000000U)
#define MC_ME_PRTN0_CORE7_STAT_WFI_SHIFT         (31U)
#define MC_ME_PRTN0_CORE7_STAT_WFI_WIDTH         (1U)
#define MC_ME_PRTN0_CORE7_STAT_WFI(x)            (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_CORE7_STAT_WFI_SHIFT)) & MC_ME_PRTN0_CORE7_STAT_WFI_MASK)
/*! @} */

/*! @name PRTN0_CORE7_ADDR - Partition 0 Core 7 Address Register */
/*! @{ */

#define MC_ME_PRTN0_CORE7_ADDR_ADDR_MASK         (0xFFFFFFFCU)
#define MC_ME_PRTN0_CORE7_ADDR_ADDR_SHIFT        (2U)
#define MC_ME_PRTN0_CORE7_ADDR_ADDR_WIDTH        (30U)
#define MC_ME_PRTN0_CORE7_ADDR_ADDR(x)           (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN0_CORE7_ADDR_ADDR_SHIFT)) & MC_ME_PRTN0_CORE7_ADDR_ADDR_MASK)
/*! @} */

/*! @name PRTN1_PCONF - Partition 1 Process Configuration Register */
/*! @{ */

#define MC_ME_PRTN1_PCONF_PCE_MASK               (0x1U)
#define MC_ME_PRTN1_PCONF_PCE_SHIFT              (0U)
#define MC_ME_PRTN1_PCONF_PCE_WIDTH              (1U)
#define MC_ME_PRTN1_PCONF_PCE(x)                 (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_PCONF_PCE_SHIFT)) & MC_ME_PRTN1_PCONF_PCE_MASK)
/*! @} */

/*! @name PRTN1_PUPD - Partition 1 Process Update Register */
/*! @{ */

#define MC_ME_PRTN1_PUPD_PCUD_MASK               (0x1U)
#define MC_ME_PRTN1_PUPD_PCUD_SHIFT              (0U)
#define MC_ME_PRTN1_PUPD_PCUD_WIDTH              (1U)
#define MC_ME_PRTN1_PUPD_PCUD(x)                 (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_PUPD_PCUD_SHIFT)) & MC_ME_PRTN1_PUPD_PCUD_MASK)
/*! @} */

/*! @name PRTN1_STAT - Partition 1 Status Register */
/*! @{ */

#define MC_ME_PRTN1_STAT_PCS_MASK                (0x1U)
#define MC_ME_PRTN1_STAT_PCS_SHIFT               (0U)
#define MC_ME_PRTN1_STAT_PCS_WIDTH               (1U)
#define MC_ME_PRTN1_STAT_PCS(x)                  (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_STAT_PCS_SHIFT)) & MC_ME_PRTN1_STAT_PCS_MASK)
/*! @} */

/*! @name PRTN1_COFB0_STAT - Partition 1 COFB Set 0 Clock Status Register */
/*! @{ */

#define MC_ME_PRTN1_COFB0_STAT_BLOCK0_MASK       (0x1U)
#define MC_ME_PRTN1_COFB0_STAT_BLOCK0_SHIFT      (0U)
#define MC_ME_PRTN1_COFB0_STAT_BLOCK0_WIDTH      (1U)
#define MC_ME_PRTN1_COFB0_STAT_BLOCK0(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB0_STAT_BLOCK0_SHIFT)) & MC_ME_PRTN1_COFB0_STAT_BLOCK0_MASK)

#define MC_ME_PRTN1_COFB0_STAT_BLOCK1_MASK       (0x2U)
#define MC_ME_PRTN1_COFB0_STAT_BLOCK1_SHIFT      (1U)
#define MC_ME_PRTN1_COFB0_STAT_BLOCK1_WIDTH      (1U)
#define MC_ME_PRTN1_COFB0_STAT_BLOCK1(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB0_STAT_BLOCK1_SHIFT)) & MC_ME_PRTN1_COFB0_STAT_BLOCK1_MASK)

#define MC_ME_PRTN1_COFB0_STAT_BLOCK2_MASK       (0x4U)
#define MC_ME_PRTN1_COFB0_STAT_BLOCK2_SHIFT      (2U)
#define MC_ME_PRTN1_COFB0_STAT_BLOCK2_WIDTH      (1U)
#define MC_ME_PRTN1_COFB0_STAT_BLOCK2(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB0_STAT_BLOCK2_SHIFT)) & MC_ME_PRTN1_COFB0_STAT_BLOCK2_MASK)

#define MC_ME_PRTN1_COFB0_STAT_BLOCK3_MASK       (0x8U)
#define MC_ME_PRTN1_COFB0_STAT_BLOCK3_SHIFT      (3U)
#define MC_ME_PRTN1_COFB0_STAT_BLOCK3_WIDTH      (1U)
#define MC_ME_PRTN1_COFB0_STAT_BLOCK3(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB0_STAT_BLOCK3_SHIFT)) & MC_ME_PRTN1_COFB0_STAT_BLOCK3_MASK)

#define MC_ME_PRTN1_COFB0_STAT_BLOCK4_MASK       (0x10U)
#define MC_ME_PRTN1_COFB0_STAT_BLOCK4_SHIFT      (4U)
#define MC_ME_PRTN1_COFB0_STAT_BLOCK4_WIDTH      (1U)
#define MC_ME_PRTN1_COFB0_STAT_BLOCK4(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB0_STAT_BLOCK4_SHIFT)) & MC_ME_PRTN1_COFB0_STAT_BLOCK4_MASK)

#define MC_ME_PRTN1_COFB0_STAT_BLOCK5_MASK       (0x20U)
#define MC_ME_PRTN1_COFB0_STAT_BLOCK5_SHIFT      (5U)
#define MC_ME_PRTN1_COFB0_STAT_BLOCK5_WIDTH      (1U)
#define MC_ME_PRTN1_COFB0_STAT_BLOCK5(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB0_STAT_BLOCK5_SHIFT)) & MC_ME_PRTN1_COFB0_STAT_BLOCK5_MASK)

#define MC_ME_PRTN1_COFB0_STAT_BLOCK6_MASK       (0x40U)
#define MC_ME_PRTN1_COFB0_STAT_BLOCK6_SHIFT      (6U)
#define MC_ME_PRTN1_COFB0_STAT_BLOCK6_WIDTH      (1U)
#define MC_ME_PRTN1_COFB0_STAT_BLOCK6(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB0_STAT_BLOCK6_SHIFT)) & MC_ME_PRTN1_COFB0_STAT_BLOCK6_MASK)

#define MC_ME_PRTN1_COFB0_STAT_BLOCK7_MASK       (0x80U)
#define MC_ME_PRTN1_COFB0_STAT_BLOCK7_SHIFT      (7U)
#define MC_ME_PRTN1_COFB0_STAT_BLOCK7_WIDTH      (1U)
#define MC_ME_PRTN1_COFB0_STAT_BLOCK7(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB0_STAT_BLOCK7_SHIFT)) & MC_ME_PRTN1_COFB0_STAT_BLOCK7_MASK)

#define MC_ME_PRTN1_COFB0_STAT_BLOCK8_MASK       (0x100U)
#define MC_ME_PRTN1_COFB0_STAT_BLOCK8_SHIFT      (8U)
#define MC_ME_PRTN1_COFB0_STAT_BLOCK8_WIDTH      (1U)
#define MC_ME_PRTN1_COFB0_STAT_BLOCK8(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB0_STAT_BLOCK8_SHIFT)) & MC_ME_PRTN1_COFB0_STAT_BLOCK8_MASK)

#define MC_ME_PRTN1_COFB0_STAT_BLOCK9_MASK       (0x200U)
#define MC_ME_PRTN1_COFB0_STAT_BLOCK9_SHIFT      (9U)
#define MC_ME_PRTN1_COFB0_STAT_BLOCK9_WIDTH      (1U)
#define MC_ME_PRTN1_COFB0_STAT_BLOCK9(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB0_STAT_BLOCK9_SHIFT)) & MC_ME_PRTN1_COFB0_STAT_BLOCK9_MASK)

