zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_ME.h
#define MC_ME_PRTN1_COFB1_CLKEN_REQ49_MASK       (0x20000U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ49_SHIFT      (17U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ49_WIDTH      (1U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ49(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB1_CLKEN_REQ49_SHIFT)) & MC_ME_PRTN1_COFB1_CLKEN_REQ49_MASK)

#define MC_ME_PRTN1_COFB1_CLKEN_REQ50_MASK       (0x40000U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ50_SHIFT      (18U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ50_WIDTH      (1U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ50(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB1_CLKEN_REQ50_SHIFT)) & MC_ME_PRTN1_COFB1_CLKEN_REQ50_MASK)

#define MC_ME_PRTN1_COFB1_CLKEN_REQ51_MASK       (0x80000U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ51_SHIFT      (19U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ51_WIDTH      (1U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ51(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB1_CLKEN_REQ51_SHIFT)) & MC_ME_PRTN1_COFB1_CLKEN_REQ51_MASK)

#define MC_ME_PRTN1_COFB1_CLKEN_REQ52_MASK       (0x100000U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ52_SHIFT      (20U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ52_WIDTH      (1U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ52(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB1_CLKEN_REQ52_SHIFT)) & MC_ME_PRTN1_COFB1_CLKEN_REQ52_MASK)

#define MC_ME_PRTN1_COFB1_CLKEN_REQ53_MASK       (0x200000U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ53_SHIFT      (21U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ53_WIDTH      (1U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ53(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB1_CLKEN_REQ53_SHIFT)) & MC_ME_PRTN1_COFB1_CLKEN_REQ53_MASK)

#define MC_ME_PRTN1_COFB1_CLKEN_REQ54_MASK       (0x400000U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ54_SHIFT      (22U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ54_WIDTH      (1U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ54(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB1_CLKEN_REQ54_SHIFT)) & MC_ME_PRTN1_COFB1_CLKEN_REQ54_MASK)

#define MC_ME_PRTN1_COFB1_CLKEN_REQ55_MASK       (0x800000U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ55_SHIFT      (23U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ55_WIDTH      (1U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ55(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB1_CLKEN_REQ55_SHIFT)) & MC_ME_PRTN1_COFB1_CLKEN_REQ55_MASK)

#define MC_ME_PRTN1_COFB1_CLKEN_REQ56_MASK       (0x1000000U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ56_SHIFT      (24U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ56_WIDTH      (1U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ56(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB1_CLKEN_REQ56_SHIFT)) & MC_ME_PRTN1_COFB1_CLKEN_REQ56_MASK)

#define MC_ME_PRTN1_COFB1_CLKEN_REQ57_MASK       (0x2000000U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ57_SHIFT      (25U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ57_WIDTH      (1U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ57(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB1_CLKEN_REQ57_SHIFT)) & MC_ME_PRTN1_COFB1_CLKEN_REQ57_MASK)

#define MC_ME_PRTN1_COFB1_CLKEN_REQ58_MASK       (0x4000000U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ58_SHIFT      (26U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ58_WIDTH      (1U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ58(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB1_CLKEN_REQ58_SHIFT)) & MC_ME_PRTN1_COFB1_CLKEN_REQ58_MASK)

#define MC_ME_PRTN1_COFB1_CLKEN_REQ59_MASK       (0x8000000U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ59_SHIFT      (27U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ59_WIDTH      (1U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ59(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB1_CLKEN_REQ59_SHIFT)) & MC_ME_PRTN1_COFB1_CLKEN_REQ59_MASK)

#define MC_ME_PRTN1_COFB1_CLKEN_REQ60_MASK       (0x10000000U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ60_SHIFT      (28U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ60_WIDTH      (1U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ60(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB1_CLKEN_REQ60_SHIFT)) & MC_ME_PRTN1_COFB1_CLKEN_REQ60_MASK)
/*! @} */

/*! @name PRTN1_CORE0_PCONF - Partition 1 Core 0 Process Configuration Register */
/*! @{ */

#define MC_ME_PRTN1_CORE0_PCONF_CCE_MASK         (0x1U)
#define MC_ME_PRTN1_CORE0_PCONF_CCE_SHIFT        (0U)
#define MC_ME_PRTN1_CORE0_PCONF_CCE_WIDTH        (1U)
#define MC_ME_PRTN1_CORE0_PCONF_CCE(x)           (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_CORE0_PCONF_CCE_SHIFT)) & MC_ME_PRTN1_CORE0_PCONF_CCE_MASK)
/*! @} */

/*! @name PRTN1_CORE0_PUPD - Partition 1 Core 0 Process Update Register */
/*! @{ */

#define MC_ME_PRTN1_CORE0_PUPD_CCUPD_MASK        (0x1U)
#define MC_ME_PRTN1_CORE0_PUPD_CCUPD_SHIFT       (0U)
#define MC_ME_PRTN1_CORE0_PUPD_CCUPD_WIDTH       (1U)
#define MC_ME_PRTN1_CORE0_PUPD_CCUPD(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_CORE0_PUPD_CCUPD_SHIFT)) & MC_ME_PRTN1_CORE0_PUPD_CCUPD_MASK)
/*! @} */

/*! @name PRTN1_CORE0_STAT - Partition 1 Core 0 Status Register */
/*! @{ */

#define MC_ME_PRTN1_CORE0_STAT_CCS_MASK          (0x1U)
#define MC_ME_PRTN1_CORE0_STAT_CCS_SHIFT         (0U)
#define MC_ME_PRTN1_CORE0_STAT_CCS_WIDTH         (1U)
#define MC_ME_PRTN1_CORE0_STAT_CCS(x)            (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_CORE0_STAT_CCS_SHIFT)) & MC_ME_PRTN1_CORE0_STAT_CCS_MASK)

#define MC_ME_PRTN1_CORE0_STAT_WFI_MASK          (0x80000000U)
#define MC_ME_PRTN1_CORE0_STAT_WFI_SHIFT         (31U)
#define MC_ME_PRTN1_CORE0_STAT_WFI_WIDTH         (1U)
#define MC_ME_PRTN1_CORE0_STAT_WFI(x)            (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_CORE0_STAT_WFI_SHIFT)) & MC_ME_PRTN1_CORE0_STAT_WFI_MASK)
/*! @} */

/*! @name PRTN1_CORE0_ADDR - Partition 1 Core 0 Address Register */
/*! @{ */

#define MC_ME_PRTN1_CORE0_ADDR_ADDR_MASK         (0xFFFFFFFCU)
#define MC_ME_PRTN1_CORE0_ADDR_ADDR_SHIFT        (2U)
#define MC_ME_PRTN1_CORE0_ADDR_ADDR_WIDTH        (30U)
#define MC_ME_PRTN1_CORE0_ADDR_ADDR(x)           (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_CORE0_ADDR_ADDR_SHIFT)) & MC_ME_PRTN1_CORE0_ADDR_ADDR_MASK)
/*! @} */

/*! @name PRTN2_PCONF - Partition 2 Process Configuration Register */
/*! @{ */

#define MC_ME_PRTN2_PCONF_PCE_MASK               (0x1U)
#define MC_ME_PRTN2_PCONF_PCE_SHIFT              (0U)
#define MC_ME_PRTN2_PCONF_PCE_WIDTH              (1U)
#define MC_ME_PRTN2_PCONF_PCE(x)                 (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_PCONF_PCE_SHIFT)) & MC_ME_PRTN2_PCONF_PCE_MASK)
/*! @} */

