zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_ME.h
#define MC_ME_PRTN2_COFB1_STAT_BLOCK50_MASK      (0x40000U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK50_SHIFT     (18U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK50_WIDTH     (1U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK50(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_STAT_BLOCK50_SHIFT)) & MC_ME_PRTN2_COFB1_STAT_BLOCK50_MASK)

#define MC_ME_PRTN2_COFB1_STAT_BLOCK51_MASK      (0x80000U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK51_SHIFT     (19U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK51_WIDTH     (1U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK51(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_STAT_BLOCK51_SHIFT)) & MC_ME_PRTN2_COFB1_STAT_BLOCK51_MASK)

#define MC_ME_PRTN2_COFB1_STAT_BLOCK52_MASK      (0x100000U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK52_SHIFT     (20U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK52_WIDTH     (1U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK52(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_STAT_BLOCK52_SHIFT)) & MC_ME_PRTN2_COFB1_STAT_BLOCK52_MASK)

#define MC_ME_PRTN2_COFB1_STAT_BLOCK54_MASK      (0x400000U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK54_SHIFT     (22U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK54_WIDTH     (1U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK54(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_STAT_BLOCK54_SHIFT)) & MC_ME_PRTN2_COFB1_STAT_BLOCK54_MASK)

#define MC_ME_PRTN2_COFB1_STAT_BLOCK55_MASK      (0x800000U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK55_SHIFT     (23U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK55_WIDTH     (1U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK55(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_STAT_BLOCK55_SHIFT)) & MC_ME_PRTN2_COFB1_STAT_BLOCK55_MASK)

#define MC_ME_PRTN2_COFB1_STAT_BLOCK56_MASK      (0x1000000U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK56_SHIFT     (24U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK56_WIDTH     (1U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK56(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_STAT_BLOCK56_SHIFT)) & MC_ME_PRTN2_COFB1_STAT_BLOCK56_MASK)

#define MC_ME_PRTN2_COFB1_STAT_BLOCK57_MASK      (0x2000000U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK57_SHIFT     (25U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK57_WIDTH     (1U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK57(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_STAT_BLOCK57_SHIFT)) & MC_ME_PRTN2_COFB1_STAT_BLOCK57_MASK)

#define MC_ME_PRTN2_COFB1_STAT_BLOCK58_MASK      (0x4000000U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK58_SHIFT     (26U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK58_WIDTH     (1U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK58(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_STAT_BLOCK58_SHIFT)) & MC_ME_PRTN2_COFB1_STAT_BLOCK58_MASK)

#define MC_ME_PRTN2_COFB1_STAT_BLOCK59_MASK      (0x8000000U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK59_SHIFT     (27U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK59_WIDTH     (1U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK59(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_STAT_BLOCK59_SHIFT)) & MC_ME_PRTN2_COFB1_STAT_BLOCK59_MASK)

#define MC_ME_PRTN2_COFB1_STAT_BLOCK60_MASK      (0x10000000U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK60_SHIFT     (28U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK60_WIDTH     (1U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK60(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_STAT_BLOCK60_SHIFT)) & MC_ME_PRTN2_COFB1_STAT_BLOCK60_MASK)

#define MC_ME_PRTN2_COFB1_STAT_BLOCK61_MASK      (0x20000000U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK61_SHIFT     (29U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK61_WIDTH     (1U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK61(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_STAT_BLOCK61_SHIFT)) & MC_ME_PRTN2_COFB1_STAT_BLOCK61_MASK)

#define MC_ME_PRTN2_COFB1_STAT_BLOCK62_MASK      (0x40000000U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK62_SHIFT     (30U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK62_WIDTH     (1U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK62(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_STAT_BLOCK62_SHIFT)) & MC_ME_PRTN2_COFB1_STAT_BLOCK62_MASK)

#define MC_ME_PRTN2_COFB1_STAT_BLOCK63_MASK      (0x80000000U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK63_SHIFT     (31U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK63_WIDTH     (1U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK63(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_STAT_BLOCK63_SHIFT)) & MC_ME_PRTN2_COFB1_STAT_BLOCK63_MASK)
/*! @} */

/*! @name PRTN2_COFB2_STAT - Partition 2 COFB Set 2 Clock Status Register */
/*! @{ */

#define MC_ME_PRTN2_COFB2_STAT_BLOCK64_MASK      (0x1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK64_SHIFT     (0U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK64_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK64(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK64_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK64_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK65_MASK      (0x2U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK65_SHIFT     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK65_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK65(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK65_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK65_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK66_MASK      (0x4U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK66_SHIFT     (2U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK66_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK66(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK66_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK66_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK67_MASK      (0x8U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK67_SHIFT     (3U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK67_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK67(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK67_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK67_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK68_MASK      (0x10U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK68_SHIFT     (4U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK68_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK68(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK68_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK68_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK69_MASK      (0x20U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK69_SHIFT     (5U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK69_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK69(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK69_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK69_MASK)

