zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_ME.h
#define MC_ME_PRTN2_COFB2_STAT_BLOCK70_MASK      (0x40U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK70_SHIFT     (6U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK70_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK70(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK70_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK70_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK71_MASK      (0x80U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK71_SHIFT     (7U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK71_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK71(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK71_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK71_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK72_MASK      (0x100U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK72_SHIFT     (8U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK72_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK72(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK72_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK72_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK73_MASK      (0x200U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK73_SHIFT     (9U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK73_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK73(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK73_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK73_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK74_MASK      (0x400U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK74_SHIFT     (10U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK74_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK74(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK74_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK74_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK75_MASK      (0x800U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK75_SHIFT     (11U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK75_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK75(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK75_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK75_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK76_MASK      (0x1000U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK76_SHIFT     (12U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK76_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK76(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK76_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK76_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK77_MASK      (0x2000U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK77_SHIFT     (13U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK77_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK77(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK77_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK77_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK78_MASK      (0x4000U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK78_SHIFT     (14U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK78_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK78(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK78_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK78_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK79_MASK      (0x8000U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK79_SHIFT     (15U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK79_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK79(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK79_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK79_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK80_MASK      (0x10000U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK80_SHIFT     (16U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK80_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK80(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK80_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK80_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK81_MASK      (0x20000U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK81_SHIFT     (17U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK81_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK81(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK81_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK81_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK82_MASK      (0x40000U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK82_SHIFT     (18U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK82_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK82(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK82_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK82_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK83_MASK      (0x80000U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK83_SHIFT     (19U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK83_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK83(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK83_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK83_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK84_MASK      (0x100000U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK84_SHIFT     (20U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK84_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK84(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK84_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK84_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK85_MASK      (0x200000U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK85_SHIFT     (21U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK85_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK85(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK85_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK85_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK86_MASK      (0x400000U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK86_SHIFT     (22U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK86_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK86(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK86_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK86_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK87_MASK      (0x800000U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK87_SHIFT     (23U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK87_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK87(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK87_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK87_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK88_MASK      (0x1000000U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK88_SHIFT     (24U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK88_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK88(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK88_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK88_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK89_MASK      (0x2000000U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK89_SHIFT     (25U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK89_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK89(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK89_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK89_MASK)

#define MC_ME_PRTN2_COFB2_STAT_BLOCK90_MASK      (0x4000000U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK90_SHIFT     (26U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK90_WIDTH     (1U)
#define MC_ME_PRTN2_COFB2_STAT_BLOCK90(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_STAT_BLOCK90_SHIFT)) & MC_ME_PRTN2_COFB2_STAT_BLOCK90_MASK)

