zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_ME.h
#define MC_ME_PRTN2_COFB3_STAT_BLOCK110_MASK     (0x4000U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK110_SHIFT    (14U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK110_WIDTH    (1U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK110(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB3_STAT_BLOCK110_SHIFT)) & MC_ME_PRTN2_COFB3_STAT_BLOCK110_MASK)

#define MC_ME_PRTN2_COFB3_STAT_BLOCK111_MASK     (0x8000U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK111_SHIFT    (15U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK111_WIDTH    (1U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK111(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB3_STAT_BLOCK111_SHIFT)) & MC_ME_PRTN2_COFB3_STAT_BLOCK111_MASK)

#define MC_ME_PRTN2_COFB3_STAT_BLOCK112_MASK     (0x10000U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK112_SHIFT    (16U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK112_WIDTH    (1U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK112(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB3_STAT_BLOCK112_SHIFT)) & MC_ME_PRTN2_COFB3_STAT_BLOCK112_MASK)

#define MC_ME_PRTN2_COFB3_STAT_BLOCK113_MASK     (0x20000U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK113_SHIFT    (17U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK113_WIDTH    (1U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK113(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB3_STAT_BLOCK113_SHIFT)) & MC_ME_PRTN2_COFB3_STAT_BLOCK113_MASK)

#define MC_ME_PRTN2_COFB3_STAT_BLOCK114_MASK     (0x40000U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK114_SHIFT    (18U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK114_WIDTH    (1U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK114(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB3_STAT_BLOCK114_SHIFT)) & MC_ME_PRTN2_COFB3_STAT_BLOCK114_MASK)

#define MC_ME_PRTN2_COFB3_STAT_BLOCK115_MASK     (0x80000U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK115_SHIFT    (19U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK115_WIDTH    (1U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK115(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB3_STAT_BLOCK115_SHIFT)) & MC_ME_PRTN2_COFB3_STAT_BLOCK115_MASK)

#define MC_ME_PRTN2_COFB3_STAT_BLOCK116_MASK     (0x100000U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK116_SHIFT    (20U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK116_WIDTH    (1U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK116(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB3_STAT_BLOCK116_SHIFT)) & MC_ME_PRTN2_COFB3_STAT_BLOCK116_MASK)

#define MC_ME_PRTN2_COFB3_STAT_BLOCK117_MASK     (0x200000U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK117_SHIFT    (21U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK117_WIDTH    (1U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK117(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB3_STAT_BLOCK117_SHIFT)) & MC_ME_PRTN2_COFB3_STAT_BLOCK117_MASK)

#define MC_ME_PRTN2_COFB3_STAT_BLOCK118_MASK     (0x400000U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK118_SHIFT    (22U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK118_WIDTH    (1U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK118(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB3_STAT_BLOCK118_SHIFT)) & MC_ME_PRTN2_COFB3_STAT_BLOCK118_MASK)

#define MC_ME_PRTN2_COFB3_STAT_BLOCK119_MASK     (0x800000U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK119_SHIFT    (23U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK119_WIDTH    (1U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK119(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB3_STAT_BLOCK119_SHIFT)) & MC_ME_PRTN2_COFB3_STAT_BLOCK119_MASK)

#define MC_ME_PRTN2_COFB3_STAT_BLOCK120_MASK     (0x1000000U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK120_SHIFT    (24U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK120_WIDTH    (1U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK120(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB3_STAT_BLOCK120_SHIFT)) & MC_ME_PRTN2_COFB3_STAT_BLOCK120_MASK)

#define MC_ME_PRTN2_COFB3_STAT_BLOCK121_MASK     (0x2000000U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK121_SHIFT    (25U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK121_WIDTH    (1U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK121(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB3_STAT_BLOCK121_SHIFT)) & MC_ME_PRTN2_COFB3_STAT_BLOCK121_MASK)

#define MC_ME_PRTN2_COFB3_STAT_BLOCK122_MASK     (0x4000000U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK122_SHIFT    (26U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK122_WIDTH    (1U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK122(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB3_STAT_BLOCK122_SHIFT)) & MC_ME_PRTN2_COFB3_STAT_BLOCK122_MASK)

#define MC_ME_PRTN2_COFB3_STAT_BLOCK123_MASK     (0x8000000U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK123_SHIFT    (27U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK123_WIDTH    (1U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK123(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB3_STAT_BLOCK123_SHIFT)) & MC_ME_PRTN2_COFB3_STAT_BLOCK123_MASK)

#define MC_ME_PRTN2_COFB3_STAT_BLOCK124_MASK     (0x10000000U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK124_SHIFT    (28U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK124_WIDTH    (1U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK124(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB3_STAT_BLOCK124_SHIFT)) & MC_ME_PRTN2_COFB3_STAT_BLOCK124_MASK)

#define MC_ME_PRTN2_COFB3_STAT_BLOCK125_MASK     (0x20000000U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK125_SHIFT    (29U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK125_WIDTH    (1U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK125(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB3_STAT_BLOCK125_SHIFT)) & MC_ME_PRTN2_COFB3_STAT_BLOCK125_MASK)

#define MC_ME_PRTN2_COFB3_STAT_BLOCK126_MASK     (0x40000000U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK126_SHIFT    (30U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK126_WIDTH    (1U)
#define MC_ME_PRTN2_COFB3_STAT_BLOCK126(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB3_STAT_BLOCK126_SHIFT)) & MC_ME_PRTN2_COFB3_STAT_BLOCK126_MASK)
/*! @} */

/*! @name PRTN2_COFB0_CLKEN - Partition 2 COFB Set 0 Clock Enable Register */
/*! @{ */

#define MC_ME_PRTN2_COFB0_CLKEN_REQ3_MASK        (0x8U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ3_SHIFT       (3U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ3_WIDTH       (1U)
#define MC_ME_PRTN2_COFB0_CLKEN_REQ3(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB0_CLKEN_REQ3_SHIFT)) & MC_ME_PRTN2_COFB0_CLKEN_REQ3_MASK)

