zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_ME.h
#define MC_ME_PRTN2_COFB1_CLKEN_REQ36_MASK       (0x10U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ36_SHIFT      (4U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ36_WIDTH      (1U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ36(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_CLKEN_REQ36_SHIFT)) & MC_ME_PRTN2_COFB1_CLKEN_REQ36_MASK)

#define MC_ME_PRTN2_COFB1_CLKEN_REQ37_MASK       (0x20U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ37_SHIFT      (5U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ37_WIDTH      (1U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ37(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_CLKEN_REQ37_SHIFT)) & MC_ME_PRTN2_COFB1_CLKEN_REQ37_MASK)

#define MC_ME_PRTN2_COFB1_CLKEN_REQ41_MASK       (0x200U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ41_SHIFT      (9U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ41_WIDTH      (1U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ41(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_CLKEN_REQ41_SHIFT)) & MC_ME_PRTN2_COFB1_CLKEN_REQ41_MASK)

#define MC_ME_PRTN2_COFB1_CLKEN_REQ42_MASK       (0x400U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ42_SHIFT      (10U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ42_WIDTH      (1U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ42(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_CLKEN_REQ42_SHIFT)) & MC_ME_PRTN2_COFB1_CLKEN_REQ42_MASK)

#define MC_ME_PRTN2_COFB1_CLKEN_REQ47_MASK       (0x8000U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ47_SHIFT      (15U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ47_WIDTH      (1U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ47(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_CLKEN_REQ47_SHIFT)) & MC_ME_PRTN2_COFB1_CLKEN_REQ47_MASK)

#define MC_ME_PRTN2_COFB1_CLKEN_REQ48_MASK       (0x10000U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ48_SHIFT      (16U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ48_WIDTH      (1U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ48(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_CLKEN_REQ48_SHIFT)) & MC_ME_PRTN2_COFB1_CLKEN_REQ48_MASK)

#define MC_ME_PRTN2_COFB1_CLKEN_REQ49_MASK       (0x20000U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ49_SHIFT      (17U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ49_WIDTH      (1U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ49(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_CLKEN_REQ49_SHIFT)) & MC_ME_PRTN2_COFB1_CLKEN_REQ49_MASK)

#define MC_ME_PRTN2_COFB1_CLKEN_REQ50_MASK       (0x40000U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ50_SHIFT      (18U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ50_WIDTH      (1U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ50(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_CLKEN_REQ50_SHIFT)) & MC_ME_PRTN2_COFB1_CLKEN_REQ50_MASK)

#define MC_ME_PRTN2_COFB1_CLKEN_REQ51_MASK       (0x80000U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ51_SHIFT      (19U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ51_WIDTH      (1U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ51(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_CLKEN_REQ51_SHIFT)) & MC_ME_PRTN2_COFB1_CLKEN_REQ51_MASK)

#define MC_ME_PRTN2_COFB1_CLKEN_REQ52_MASK       (0x100000U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ52_SHIFT      (20U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ52_WIDTH      (1U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ52(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_CLKEN_REQ52_SHIFT)) & MC_ME_PRTN2_COFB1_CLKEN_REQ52_MASK)

#define MC_ME_PRTN2_COFB1_CLKEN_REQ54_MASK       (0x400000U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ54_SHIFT      (22U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ54_WIDTH      (1U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ54(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_CLKEN_REQ54_SHIFT)) & MC_ME_PRTN2_COFB1_CLKEN_REQ54_MASK)

#define MC_ME_PRTN2_COFB1_CLKEN_REQ55_MASK       (0x800000U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ55_SHIFT      (23U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ55_WIDTH      (1U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ55(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_CLKEN_REQ55_SHIFT)) & MC_ME_PRTN2_COFB1_CLKEN_REQ55_MASK)

#define MC_ME_PRTN2_COFB1_CLKEN_REQ56_MASK       (0x1000000U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ56_SHIFT      (24U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ56_WIDTH      (1U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ56(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_CLKEN_REQ56_SHIFT)) & MC_ME_PRTN2_COFB1_CLKEN_REQ56_MASK)

#define MC_ME_PRTN2_COFB1_CLKEN_REQ57_MASK       (0x2000000U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ57_SHIFT      (25U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ57_WIDTH      (1U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ57(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_CLKEN_REQ57_SHIFT)) & MC_ME_PRTN2_COFB1_CLKEN_REQ57_MASK)

#define MC_ME_PRTN2_COFB1_CLKEN_REQ58_MASK       (0x4000000U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ58_SHIFT      (26U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ58_WIDTH      (1U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ58(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_CLKEN_REQ58_SHIFT)) & MC_ME_PRTN2_COFB1_CLKEN_REQ58_MASK)

#define MC_ME_PRTN2_COFB1_CLKEN_REQ59_MASK       (0x8000000U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ59_SHIFT      (27U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ59_WIDTH      (1U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ59(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_CLKEN_REQ59_SHIFT)) & MC_ME_PRTN2_COFB1_CLKEN_REQ59_MASK)

#define MC_ME_PRTN2_COFB1_CLKEN_REQ60_MASK       (0x10000000U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ60_SHIFT      (28U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ60_WIDTH      (1U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ60(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_CLKEN_REQ60_SHIFT)) & MC_ME_PRTN2_COFB1_CLKEN_REQ60_MASK)

#define MC_ME_PRTN2_COFB1_CLKEN_REQ61_MASK       (0x20000000U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ61_SHIFT      (29U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ61_WIDTH      (1U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ61(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_CLKEN_REQ61_SHIFT)) & MC_ME_PRTN2_COFB1_CLKEN_REQ61_MASK)

#define MC_ME_PRTN2_COFB1_CLKEN_REQ62_MASK       (0x40000000U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ62_SHIFT      (30U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ62_WIDTH      (1U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ62(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_CLKEN_REQ62_SHIFT)) & MC_ME_PRTN2_COFB1_CLKEN_REQ62_MASK)

#define MC_ME_PRTN2_COFB1_CLKEN_REQ63_MASK       (0x80000000U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ63_SHIFT      (31U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ63_WIDTH      (1U)
#define MC_ME_PRTN2_COFB1_CLKEN_REQ63(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_CLKEN_REQ63_SHIFT)) & MC_ME_PRTN2_COFB1_CLKEN_REQ63_MASK)
/*! @} */

/*! @name PRTN2_COFB2_CLKEN - Partition 2 COFB Set 2 Clock Enable Register */
/*! @{ */

#define MC_ME_PRTN2_COFB2_CLKEN_REQ64_MASK       (0x1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ64_SHIFT      (0U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ64_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ64(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ64_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ64_MASK)

