zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_ME.h
#define MC_ME_PRTN2_COFB2_CLKEN_REQ65_MASK       (0x2U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ65_SHIFT      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ65_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ65(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ65_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ65_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ66_MASK       (0x4U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ66_SHIFT      (2U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ66_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ66(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ66_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ66_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ67_MASK       (0x8U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ67_SHIFT      (3U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ67_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ67(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ67_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ67_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ68_MASK       (0x10U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ68_SHIFT      (4U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ68_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ68(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ68_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ68_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ69_MASK       (0x20U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ69_SHIFT      (5U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ69_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ69(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ69_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ69_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ70_MASK       (0x40U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ70_SHIFT      (6U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ70_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ70(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ70_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ70_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ71_MASK       (0x80U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ71_SHIFT      (7U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ71_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ71(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ71_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ71_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ72_MASK       (0x100U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ72_SHIFT      (8U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ72_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ72(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ72_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ72_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ73_MASK       (0x200U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ73_SHIFT      (9U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ73_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ73(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ73_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ73_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ74_MASK       (0x400U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ74_SHIFT      (10U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ74_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ74(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ74_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ74_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ75_MASK       (0x800U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ75_SHIFT      (11U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ75_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ75(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ75_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ75_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ76_MASK       (0x1000U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ76_SHIFT      (12U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ76_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ76(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ76_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ76_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ77_MASK       (0x2000U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ77_SHIFT      (13U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ77_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ77(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ77_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ77_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ78_MASK       (0x4000U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ78_SHIFT      (14U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ78_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ78(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ78_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ78_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ79_MASK       (0x8000U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ79_SHIFT      (15U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ79_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ79(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ79_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ79_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ80_MASK       (0x10000U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ80_SHIFT      (16U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ80_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ80(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ80_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ80_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ81_MASK       (0x20000U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ81_SHIFT      (17U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ81_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ81(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ81_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ81_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ82_MASK       (0x40000U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ82_SHIFT      (18U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ82_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ82(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ82_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ82_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ83_MASK       (0x80000U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ83_SHIFT      (19U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ83_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ83(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ83_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ83_MASK)

