zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_ME.h
#define MC_ME_PRTN2_COFB2_CLKEN_REQ84_MASK       (0x100000U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ84_SHIFT      (20U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ84_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ84(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ84_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ84_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ85_MASK       (0x200000U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ85_SHIFT      (21U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ85_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ85(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ85_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ85_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ86_MASK       (0x400000U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ86_SHIFT      (22U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ86_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ86(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ86_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ86_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ87_MASK       (0x800000U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ87_SHIFT      (23U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ87_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ87(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ87_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ87_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ88_MASK       (0x1000000U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ88_SHIFT      (24U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ88_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ88(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ88_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ88_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ89_MASK       (0x2000000U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ89_SHIFT      (25U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ89_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ89(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ89_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ89_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ90_MASK       (0x4000000U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ90_SHIFT      (26U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ90_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ90(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ90_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ90_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ91_MASK       (0x8000000U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ91_SHIFT      (27U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ91_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ91(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ91_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ91_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ92_MASK       (0x10000000U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ92_SHIFT      (28U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ92_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ92(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ92_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ92_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ93_MASK       (0x20000000U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ93_SHIFT      (29U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ93_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ93(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ93_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ93_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ94_MASK       (0x40000000U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ94_SHIFT      (30U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ94_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ94(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ94_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ94_MASK)

#define MC_ME_PRTN2_COFB2_CLKEN_REQ95_MASK       (0x80000000U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ95_SHIFT      (31U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ95_WIDTH      (1U)
#define MC_ME_PRTN2_COFB2_CLKEN_REQ95(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB2_CLKEN_REQ95_SHIFT)) & MC_ME_PRTN2_COFB2_CLKEN_REQ95_MASK)
/*! @} */

/*! @name PRTN2_COFB3_CLKEN - Partition 2 COFB Set 3 Clock Enable Register */
/*! @{ */

#define MC_ME_PRTN2_COFB3_CLKEN_REQ96_MASK       (0x1U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ96_SHIFT      (0U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ96_WIDTH      (1U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ96(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB3_CLKEN_REQ96_SHIFT)) & MC_ME_PRTN2_COFB3_CLKEN_REQ96_MASK)

#define MC_ME_PRTN2_COFB3_CLKEN_REQ97_MASK       (0x2U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ97_SHIFT      (1U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ97_WIDTH      (1U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ97(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB3_CLKEN_REQ97_SHIFT)) & MC_ME_PRTN2_COFB3_CLKEN_REQ97_MASK)

#define MC_ME_PRTN2_COFB3_CLKEN_REQ98_MASK       (0x4U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ98_SHIFT      (2U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ98_WIDTH      (1U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ98(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB3_CLKEN_REQ98_SHIFT)) & MC_ME_PRTN2_COFB3_CLKEN_REQ98_MASK)

#define MC_ME_PRTN2_COFB3_CLKEN_REQ99_MASK       (0x8U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ99_SHIFT      (3U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ99_WIDTH      (1U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ99(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB3_CLKEN_REQ99_SHIFT)) & MC_ME_PRTN2_COFB3_CLKEN_REQ99_MASK)

#define MC_ME_PRTN2_COFB3_CLKEN_REQ100_MASK      (0x10U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ100_SHIFT     (4U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ100_WIDTH     (1U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ100(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB3_CLKEN_REQ100_SHIFT)) & MC_ME_PRTN2_COFB3_CLKEN_REQ100_MASK)

#define MC_ME_PRTN2_COFB3_CLKEN_REQ101_MASK      (0x20U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ101_SHIFT     (5U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ101_WIDTH     (1U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ101(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB3_CLKEN_REQ101_SHIFT)) & MC_ME_PRTN2_COFB3_CLKEN_REQ101_MASK)

#define MC_ME_PRTN2_COFB3_CLKEN_REQ102_MASK      (0x40U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ102_SHIFT     (6U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ102_WIDTH     (1U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ102(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB3_CLKEN_REQ102_SHIFT)) & MC_ME_PRTN2_COFB3_CLKEN_REQ102_MASK)

#define MC_ME_PRTN2_COFB3_CLKEN_REQ103_MASK      (0x80U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ103_SHIFT     (7U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ103_WIDTH     (1U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ103(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB3_CLKEN_REQ103_SHIFT)) & MC_ME_PRTN2_COFB3_CLKEN_REQ103_MASK)

#define MC_ME_PRTN2_COFB3_CLKEN_REQ104_MASK      (0x100U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ104_SHIFT     (8U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ104_WIDTH     (1U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ104(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB3_CLKEN_REQ104_SHIFT)) & MC_ME_PRTN2_COFB3_CLKEN_REQ104_MASK)

