zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_ME.h
#define MC_ME_PRTN2_COFB3_CLKEN_REQ105_MASK      (0x200U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ105_SHIFT     (9U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ105_WIDTH     (1U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ105(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB3_CLKEN_REQ105_SHIFT)) & MC_ME_PRTN2_COFB3_CLKEN_REQ105_MASK)

#define MC_ME_PRTN2_COFB3_CLKEN_REQ114_MASK      (0x40000U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ114_SHIFT     (18U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ114_WIDTH     (1U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ114(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB3_CLKEN_REQ114_SHIFT)) & MC_ME_PRTN2_COFB3_CLKEN_REQ114_MASK)

#define MC_ME_PRTN2_COFB3_CLKEN_REQ115_MASK      (0x80000U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ115_SHIFT     (19U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ115_WIDTH     (1U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ115(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB3_CLKEN_REQ115_SHIFT)) & MC_ME_PRTN2_COFB3_CLKEN_REQ115_MASK)

#define MC_ME_PRTN2_COFB3_CLKEN_REQ116_MASK      (0x100000U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ116_SHIFT     (20U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ116_WIDTH     (1U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ116(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB3_CLKEN_REQ116_SHIFT)) & MC_ME_PRTN2_COFB3_CLKEN_REQ116_MASK)

#define MC_ME_PRTN2_COFB3_CLKEN_REQ117_MASK      (0x200000U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ117_SHIFT     (21U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ117_WIDTH     (1U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ117(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB3_CLKEN_REQ117_SHIFT)) & MC_ME_PRTN2_COFB3_CLKEN_REQ117_MASK)

#define MC_ME_PRTN2_COFB3_CLKEN_REQ118_MASK      (0x400000U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ118_SHIFT     (22U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ118_WIDTH     (1U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ118(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB3_CLKEN_REQ118_SHIFT)) & MC_ME_PRTN2_COFB3_CLKEN_REQ118_MASK)

#define MC_ME_PRTN2_COFB3_CLKEN_REQ119_MASK      (0x800000U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ119_SHIFT     (23U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ119_WIDTH     (1U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ119(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB3_CLKEN_REQ119_SHIFT)) & MC_ME_PRTN2_COFB3_CLKEN_REQ119_MASK)

#define MC_ME_PRTN2_COFB3_CLKEN_REQ120_MASK      (0x1000000U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ120_SHIFT     (24U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ120_WIDTH     (1U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ120(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB3_CLKEN_REQ120_SHIFT)) & MC_ME_PRTN2_COFB3_CLKEN_REQ120_MASK)

#define MC_ME_PRTN2_COFB3_CLKEN_REQ121_MASK      (0x2000000U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ121_SHIFT     (25U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ121_WIDTH     (1U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ121(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB3_CLKEN_REQ121_SHIFT)) & MC_ME_PRTN2_COFB3_CLKEN_REQ121_MASK)

#define MC_ME_PRTN2_COFB3_CLKEN_REQ125_MASK      (0x20000000U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ125_SHIFT     (29U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ125_WIDTH     (1U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ125(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB3_CLKEN_REQ125_SHIFT)) & MC_ME_PRTN2_COFB3_CLKEN_REQ125_MASK)

#define MC_ME_PRTN2_COFB3_CLKEN_REQ126_MASK      (0x40000000U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ126_SHIFT     (30U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ126_WIDTH     (1U)
#define MC_ME_PRTN2_COFB3_CLKEN_REQ126(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB3_CLKEN_REQ126_SHIFT)) & MC_ME_PRTN2_COFB3_CLKEN_REQ126_MASK)
/*! @} */

/*! @name PRTN3_PCONF - Partition 3 Process Configuration Register */
/*! @{ */

#define MC_ME_PRTN3_PCONF_PCE_MASK               (0x1U)
#define MC_ME_PRTN3_PCONF_PCE_SHIFT              (0U)
#define MC_ME_PRTN3_PCONF_PCE_WIDTH              (1U)
#define MC_ME_PRTN3_PCONF_PCE(x)                 (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_PCONF_PCE_SHIFT)) & MC_ME_PRTN3_PCONF_PCE_MASK)
/*! @} */

/*! @name PRTN3_PUPD - Partition 3 Process Update Register */
/*! @{ */

#define MC_ME_PRTN3_PUPD_PCUD_MASK               (0x1U)
#define MC_ME_PRTN3_PUPD_PCUD_SHIFT              (0U)
#define MC_ME_PRTN3_PUPD_PCUD_WIDTH              (1U)
#define MC_ME_PRTN3_PUPD_PCUD(x)                 (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_PUPD_PCUD_SHIFT)) & MC_ME_PRTN3_PUPD_PCUD_MASK)
/*! @} */

/*! @name PRTN3_STAT - Partition 3 Status Register */
/*! @{ */

#define MC_ME_PRTN3_STAT_PCS_MASK                (0x1U)
#define MC_ME_PRTN3_STAT_PCS_SHIFT               (0U)
#define MC_ME_PRTN3_STAT_PCS_WIDTH               (1U)
#define MC_ME_PRTN3_STAT_PCS(x)                  (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_STAT_PCS_SHIFT)) & MC_ME_PRTN3_STAT_PCS_MASK)
/*! @} */

/*! @name PRTN3_COFB0_STAT - Partition 3 COFB Set 0 Clock Status Register */
/*! @{ */

#define MC_ME_PRTN3_COFB0_STAT_BLOCK0_MASK       (0x1U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK0_SHIFT      (0U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK0_WIDTH      (1U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK0(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_STAT_BLOCK0_SHIFT)) & MC_ME_PRTN3_COFB0_STAT_BLOCK0_MASK)

#define MC_ME_PRTN3_COFB0_STAT_BLOCK3_MASK       (0x8U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK3_SHIFT      (3U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK3_WIDTH      (1U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK3(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_STAT_BLOCK3_SHIFT)) & MC_ME_PRTN3_COFB0_STAT_BLOCK3_MASK)

#define MC_ME_PRTN3_COFB0_STAT_BLOCK4_MASK       (0x10U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK4_SHIFT      (4U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK4_WIDTH      (1U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK4(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_STAT_BLOCK4_SHIFT)) & MC_ME_PRTN3_COFB0_STAT_BLOCK4_MASK)

#define MC_ME_PRTN3_COFB0_STAT_BLOCK5_MASK       (0x20U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK5_SHIFT      (5U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK5_WIDTH      (1U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK5(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_STAT_BLOCK5_SHIFT)) & MC_ME_PRTN3_COFB0_STAT_BLOCK5_MASK)

