zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_ME.h
#define MC_ME_PRTN3_COFB0_STAT_BLOCK27_MASK      (0x8000000U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK27_SHIFT     (27U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK27_WIDTH     (1U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK27(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_STAT_BLOCK27_SHIFT)) & MC_ME_PRTN3_COFB0_STAT_BLOCK27_MASK)

#define MC_ME_PRTN3_COFB0_STAT_BLOCK28_MASK      (0x10000000U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK28_SHIFT     (28U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK28_WIDTH     (1U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK28(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_STAT_BLOCK28_SHIFT)) & MC_ME_PRTN3_COFB0_STAT_BLOCK28_MASK)

#define MC_ME_PRTN3_COFB0_STAT_BLOCK29_MASK      (0x20000000U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK29_SHIFT     (29U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK29_WIDTH     (1U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK29(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_STAT_BLOCK29_SHIFT)) & MC_ME_PRTN3_COFB0_STAT_BLOCK29_MASK)

#define MC_ME_PRTN3_COFB0_STAT_BLOCK30_MASK      (0x40000000U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK30_SHIFT     (30U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK30_WIDTH     (1U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK30(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_STAT_BLOCK30_SHIFT)) & MC_ME_PRTN3_COFB0_STAT_BLOCK30_MASK)

#define MC_ME_PRTN3_COFB0_STAT_BLOCK31_MASK      (0x80000000U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK31_SHIFT     (31U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK31_WIDTH     (1U)
#define MC_ME_PRTN3_COFB0_STAT_BLOCK31(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_STAT_BLOCK31_SHIFT)) & MC_ME_PRTN3_COFB0_STAT_BLOCK31_MASK)
/*! @} */

/*! @name PRTN3_COFB1_STAT - Partition 3 COFB Set 1 Clock Status Register */
/*! @{ */

#define MC_ME_PRTN3_COFB1_STAT_BLOCK32_MASK      (0x1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK32_SHIFT     (0U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK32_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK32(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK32_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK32_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK33_MASK      (0x2U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK33_SHIFT     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK33_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK33(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK33_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK33_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK34_MASK      (0x4U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK34_SHIFT     (2U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK34_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK34(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK34_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK34_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK35_MASK      (0x8U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK35_SHIFT     (3U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK35_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK35(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK35_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK35_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK36_MASK      (0x10U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK36_SHIFT     (4U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK36_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK36(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK36_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK36_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK38_MASK      (0x40U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK38_SHIFT     (6U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK38_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK38(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK38_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK38_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK39_MASK      (0x80U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK39_SHIFT     (7U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK39_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK39(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK39_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK39_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK40_MASK      (0x100U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK40_SHIFT     (8U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK40_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK40(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK40_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK40_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK41_MASK      (0x200U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK41_SHIFT     (9U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK41_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK41(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK41_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK41_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK42_MASK      (0x400U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK42_SHIFT     (10U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK42_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK42(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK42_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK42_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK43_MASK      (0x800U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK43_SHIFT     (11U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK43_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK43(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK43_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK43_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK44_MASK      (0x1000U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK44_SHIFT     (12U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK44_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK44(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK44_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK44_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK45_MASK      (0x2000U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK45_SHIFT     (13U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK45_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK45(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK45_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK45_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK46_MASK      (0x4000U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK46_SHIFT     (14U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK46_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK46(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK46_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK46_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK47_MASK      (0x8000U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK47_SHIFT     (15U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK47_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK47(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK47_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK47_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK48_MASK      (0x10000U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK48_SHIFT     (16U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK48_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK48(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK48_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK48_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK49_MASK      (0x20000U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK49_SHIFT     (17U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK49_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK49(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK49_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK49_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK50_MASK      (0x40000U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK50_SHIFT     (18U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK50_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK50(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK50_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK50_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK51_MASK      (0x80000U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK51_SHIFT     (19U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK51_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK51(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK51_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK51_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK52_MASK      (0x100000U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK52_SHIFT     (20U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK52_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK52(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK52_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK52_MASK)

