zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_ME.h
#define MC_ME_PRTN3_COFB1_STAT_BLOCK53_MASK      (0x200000U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK53_SHIFT     (21U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK53_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK53(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK53_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK53_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK56_MASK      (0x1000000U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK56_SHIFT     (24U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK56_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK56(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK56_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK56_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK58_MASK      (0x4000000U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK58_SHIFT     (26U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK58_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK58(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK58_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK58_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK59_MASK      (0x8000000U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK59_SHIFT     (27U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK59_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK59(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK59_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK59_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK60_MASK      (0x10000000U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK60_SHIFT     (28U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK60_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK60(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK60_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK60_MASK)

#define MC_ME_PRTN3_COFB1_STAT_BLOCK61_MASK      (0x20000000U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK61_SHIFT     (29U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK61_WIDTH     (1U)
#define MC_ME_PRTN3_COFB1_STAT_BLOCK61(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_STAT_BLOCK61_SHIFT)) & MC_ME_PRTN3_COFB1_STAT_BLOCK61_MASK)
/*! @} */

/*! @name PRTN3_COFB0_CLKEN - Partition 3 COFB Set 0 Clock Enable Register */
/*! @{ */

#define MC_ME_PRTN3_COFB0_CLKEN_REQ0_MASK        (0x1U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ0_SHIFT       (0U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ0_WIDTH       (1U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ0(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_CLKEN_REQ0_SHIFT)) & MC_ME_PRTN3_COFB0_CLKEN_REQ0_MASK)

#define MC_ME_PRTN3_COFB0_CLKEN_REQ3_MASK        (0x8U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ3_SHIFT       (3U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ3_WIDTH       (1U)
#define MC_ME_PRTN3_COFB0_CLKEN_REQ3(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB0_CLKEN_REQ3_SHIFT)) & MC_ME_PRTN3_COFB0_CLKEN_REQ3_MASK)
/*! @} */

/*! @name PRTN3_COFB1_CLKEN - Partition 3 COFB Set 1 Clock Enable Register */
/*! @{ */

#define MC_ME_PRTN3_COFB1_CLKEN_REQ36_MASK       (0x10U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ36_SHIFT      (4U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ36_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ36(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ36_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ36_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ38_MASK       (0x40U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ38_SHIFT      (6U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ38_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ38(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ38_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ38_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ39_MASK       (0x80U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ39_SHIFT      (7U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ39_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ39(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ39_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ39_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ40_MASK       (0x100U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ40_SHIFT      (8U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ40_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ40(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ40_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ40_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ41_MASK       (0x200U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ41_SHIFT      (9U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ41_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ41(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ41_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ41_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ42_MASK       (0x400U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ42_SHIFT      (10U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ42_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ42(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ42_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ42_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ43_MASK       (0x800U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ43_SHIFT      (11U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ43_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ43(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ43_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ43_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ44_MASK       (0x1000U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ44_SHIFT      (12U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ44_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ44(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ44_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ44_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ45_MASK       (0x2000U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ45_SHIFT      (13U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ45_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ45(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ45_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ45_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ46_MASK       (0x4000U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ46_SHIFT      (14U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ46_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ46(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ46_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ46_MASK)

