zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_ME.h
#define MC_ME_PRTN3_COFB1_CLKEN_REQ47_MASK       (0x8000U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ47_SHIFT      (15U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ47_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ47(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ47_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ47_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ48_MASK       (0x10000U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ48_SHIFT      (16U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ48_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ48(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ48_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ48_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ49_MASK       (0x20000U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ49_SHIFT      (17U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ49_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ49(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ49_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ49_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ50_MASK       (0x40000U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ50_SHIFT      (18U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ50_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ50(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ50_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ50_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ51_MASK       (0x80000U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ51_SHIFT      (19U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ51_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ51(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ51_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ51_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ52_MASK       (0x100000U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ52_SHIFT      (20U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ52_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ52(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ52_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ52_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ53_MASK       (0x200000U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ53_SHIFT      (21U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ53_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ53(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ53_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ53_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ59_MASK       (0x8000000U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ59_SHIFT      (27U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ59_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ59(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ59_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ59_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ60_MASK       (0x10000000U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ60_SHIFT      (28U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ60_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ60(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ60_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ60_MASK)

#define MC_ME_PRTN3_COFB1_CLKEN_REQ61_MASK       (0x20000000U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ61_SHIFT      (29U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ61_WIDTH      (1U)
#define MC_ME_PRTN3_COFB1_CLKEN_REQ61(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN3_COFB1_CLKEN_REQ61_SHIFT)) & MC_ME_PRTN3_COFB1_CLKEN_REQ61_MASK)
/*! @} */

/*! @name PRTN4_PCONF - Partition 4 Process Configuration Register */
/*! @{ */

#define MC_ME_PRTN4_PCONF_PCE_MASK               (0x1U)
#define MC_ME_PRTN4_PCONF_PCE_SHIFT              (0U)
#define MC_ME_PRTN4_PCONF_PCE_WIDTH              (1U)
#define MC_ME_PRTN4_PCONF_PCE(x)                 (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN4_PCONF_PCE_SHIFT)) & MC_ME_PRTN4_PCONF_PCE_MASK)
/*! @} */

/*! @name PRTN4_PUPD - Partition 4 Process Update Register */
/*! @{ */

#define MC_ME_PRTN4_PUPD_PCUD_MASK               (0x1U)
#define MC_ME_PRTN4_PUPD_PCUD_SHIFT              (0U)
#define MC_ME_PRTN4_PUPD_PCUD_WIDTH              (1U)
#define MC_ME_PRTN4_PUPD_PCUD(x)                 (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN4_PUPD_PCUD_SHIFT)) & MC_ME_PRTN4_PUPD_PCUD_MASK)
/*! @} */

/*! @name PRTN4_STAT - Partition 4 Status Register */
/*! @{ */

#define MC_ME_PRTN4_STAT_PCS_MASK                (0x1U)
#define MC_ME_PRTN4_STAT_PCS_SHIFT               (0U)
#define MC_ME_PRTN4_STAT_PCS_WIDTH               (1U)
#define MC_ME_PRTN4_STAT_PCS(x)                  (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN4_STAT_PCS_SHIFT)) & MC_ME_PRTN4_STAT_PCS_MASK)
/*! @} */

/*! @name PRTN4_COFB0_STAT - Partition 4 COFB Set 0 Clock Status Register */
/*! @{ */

#define MC_ME_PRTN4_COFB0_STAT_BLOCK0_MASK       (0x1U)
#define MC_ME_PRTN4_COFB0_STAT_BLOCK0_SHIFT      (0U)
#define MC_ME_PRTN4_COFB0_STAT_BLOCK0_WIDTH      (1U)
#define MC_ME_PRTN4_COFB0_STAT_BLOCK0(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN4_COFB0_STAT_BLOCK0_SHIFT)) & MC_ME_PRTN4_COFB0_STAT_BLOCK0_MASK)

#define MC_ME_PRTN4_COFB0_STAT_BLOCK1_MASK       (0x2U)
#define MC_ME_PRTN4_COFB0_STAT_BLOCK1_SHIFT      (1U)
#define MC_ME_PRTN4_COFB0_STAT_BLOCK1_WIDTH      (1U)
#define MC_ME_PRTN4_COFB0_STAT_BLOCK1(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN4_COFB0_STAT_BLOCK1_SHIFT)) & MC_ME_PRTN4_COFB0_STAT_BLOCK1_MASK)

#define MC_ME_PRTN4_COFB0_STAT_BLOCK2_MASK       (0x4U)
#define MC_ME_PRTN4_COFB0_STAT_BLOCK2_SHIFT      (2U)
#define MC_ME_PRTN4_COFB0_STAT_BLOCK2_WIDTH      (1U)
#define MC_ME_PRTN4_COFB0_STAT_BLOCK2(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN4_COFB0_STAT_BLOCK2_SHIFT)) & MC_ME_PRTN4_COFB0_STAT_BLOCK2_MASK)

#define MC_ME_PRTN4_COFB0_STAT_BLOCK3_MASK       (0x8U)
#define MC_ME_PRTN4_COFB0_STAT_BLOCK3_SHIFT      (3U)
#define MC_ME_PRTN4_COFB0_STAT_BLOCK3_WIDTH      (1U)
#define MC_ME_PRTN4_COFB0_STAT_BLOCK3(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN4_COFB0_STAT_BLOCK3_SHIFT)) & MC_ME_PRTN4_COFB0_STAT_BLOCK3_MASK)

#define MC_ME_PRTN4_COFB0_STAT_BLOCK4_MASK       (0x10U)
#define MC_ME_PRTN4_COFB0_STAT_BLOCK4_SHIFT      (4U)
#define MC_ME_PRTN4_COFB0_STAT_BLOCK4_WIDTH      (1U)
#define MC_ME_PRTN4_COFB0_STAT_BLOCK4(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN4_COFB0_STAT_BLOCK4_SHIFT)) & MC_ME_PRTN4_COFB0_STAT_BLOCK4_MASK)

#define MC_ME_PRTN4_COFB0_STAT_BLOCK5_MASK       (0x20U)
#define MC_ME_PRTN4_COFB0_STAT_BLOCK5_SHIFT      (5U)
#define MC_ME_PRTN4_COFB0_STAT_BLOCK5_WIDTH      (1U)
#define MC_ME_PRTN4_COFB0_STAT_BLOCK5(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN4_COFB0_STAT_BLOCK5_SHIFT)) & MC_ME_PRTN4_COFB0_STAT_BLOCK5_MASK)

