zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_ME.h
/*! @name PRTN4_COFB0_CLKEN - Partition 4 COFB Set 0 Clock Enable Register */
/*! @{ */

#define MC_ME_PRTN4_COFB0_CLKEN_REQ0_MASK        (0x1U)
#define MC_ME_PRTN4_COFB0_CLKEN_REQ0_SHIFT       (0U)
#define MC_ME_PRTN4_COFB0_CLKEN_REQ0_WIDTH       (1U)
#define MC_ME_PRTN4_COFB0_CLKEN_REQ0(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN4_COFB0_CLKEN_REQ0_SHIFT)) & MC_ME_PRTN4_COFB0_CLKEN_REQ0_MASK)
/*! @} */

/*! @name PRTN4_COFB1_CLKEN - Partition 4 COFB Set 1 Clock Enable Register */
/*! @{ */

#define MC_ME_PRTN4_COFB1_CLKEN_REQ35_MASK       (0x8U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ35_SHIFT      (3U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ35_WIDTH      (1U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ35(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN4_COFB1_CLKEN_REQ35_SHIFT)) & MC_ME_PRTN4_COFB1_CLKEN_REQ35_MASK)

#define MC_ME_PRTN4_COFB1_CLKEN_REQ36_MASK       (0x10U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ36_SHIFT      (4U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ36_WIDTH      (1U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ36(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN4_COFB1_CLKEN_REQ36_SHIFT)) & MC_ME_PRTN4_COFB1_CLKEN_REQ36_MASK)

#define MC_ME_PRTN4_COFB1_CLKEN_REQ37_MASK       (0x20U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ37_SHIFT      (5U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ37_WIDTH      (1U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ37(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN4_COFB1_CLKEN_REQ37_SHIFT)) & MC_ME_PRTN4_COFB1_CLKEN_REQ37_MASK)

#define MC_ME_PRTN4_COFB1_CLKEN_REQ38_MASK       (0x40U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ38_SHIFT      (6U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ38_WIDTH      (1U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ38(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN4_COFB1_CLKEN_REQ38_SHIFT)) & MC_ME_PRTN4_COFB1_CLKEN_REQ38_MASK)

#define MC_ME_PRTN4_COFB1_CLKEN_REQ39_MASK       (0x80U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ39_SHIFT      (7U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ39_WIDTH      (1U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ39(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN4_COFB1_CLKEN_REQ39_SHIFT)) & MC_ME_PRTN4_COFB1_CLKEN_REQ39_MASK)

#define MC_ME_PRTN4_COFB1_CLKEN_REQ40_MASK       (0x100U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ40_SHIFT      (8U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ40_WIDTH      (1U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ40(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN4_COFB1_CLKEN_REQ40_SHIFT)) & MC_ME_PRTN4_COFB1_CLKEN_REQ40_MASK)

#define MC_ME_PRTN4_COFB1_CLKEN_REQ41_MASK       (0x200U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ41_SHIFT      (9U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ41_WIDTH      (1U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ41(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN4_COFB1_CLKEN_REQ41_SHIFT)) & MC_ME_PRTN4_COFB1_CLKEN_REQ41_MASK)

#define MC_ME_PRTN4_COFB1_CLKEN_REQ42_MASK       (0x400U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ42_SHIFT      (10U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ42_WIDTH      (1U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ42(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN4_COFB1_CLKEN_REQ42_SHIFT)) & MC_ME_PRTN4_COFB1_CLKEN_REQ42_MASK)

#define MC_ME_PRTN4_COFB1_CLKEN_REQ43_MASK       (0x800U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ43_SHIFT      (11U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ43_WIDTH      (1U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ43(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN4_COFB1_CLKEN_REQ43_SHIFT)) & MC_ME_PRTN4_COFB1_CLKEN_REQ43_MASK)

#define MC_ME_PRTN4_COFB1_CLKEN_REQ44_MASK       (0x1000U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ44_SHIFT      (12U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ44_WIDTH      (1U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ44(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN4_COFB1_CLKEN_REQ44_SHIFT)) & MC_ME_PRTN4_COFB1_CLKEN_REQ44_MASK)

#define MC_ME_PRTN4_COFB1_CLKEN_REQ45_MASK       (0x2000U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ45_SHIFT      (13U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ45_WIDTH      (1U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ45(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN4_COFB1_CLKEN_REQ45_SHIFT)) & MC_ME_PRTN4_COFB1_CLKEN_REQ45_MASK)

#define MC_ME_PRTN4_COFB1_CLKEN_REQ46_MASK       (0x4000U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ46_SHIFT      (14U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ46_WIDTH      (1U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ46(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN4_COFB1_CLKEN_REQ46_SHIFT)) & MC_ME_PRTN4_COFB1_CLKEN_REQ46_MASK)

#define MC_ME_PRTN4_COFB1_CLKEN_REQ49_MASK       (0x20000U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ49_SHIFT      (17U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ49_WIDTH      (1U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ49(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN4_COFB1_CLKEN_REQ49_SHIFT)) & MC_ME_PRTN4_COFB1_CLKEN_REQ49_MASK)

#define MC_ME_PRTN4_COFB1_CLKEN_REQ50_MASK       (0x40000U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ50_SHIFT      (18U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ50_WIDTH      (1U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ50(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN4_COFB1_CLKEN_REQ50_SHIFT)) & MC_ME_PRTN4_COFB1_CLKEN_REQ50_MASK)

#define MC_ME_PRTN4_COFB1_CLKEN_REQ51_MASK       (0x80000U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ51_SHIFT      (19U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ51_WIDTH      (1U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ51(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN4_COFB1_CLKEN_REQ51_SHIFT)) & MC_ME_PRTN4_COFB1_CLKEN_REQ51_MASK)

#define MC_ME_PRTN4_COFB1_CLKEN_REQ52_MASK       (0x100000U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ52_SHIFT      (20U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ52_WIDTH      (1U)
#define MC_ME_PRTN4_COFB1_CLKEN_REQ52(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN4_COFB1_CLKEN_REQ52_SHIFT)) & MC_ME_PRTN4_COFB1_CLKEN_REQ52_MASK)
/*! @} */

/*! @name PRTN5_PCONF - Partition 5 Process Configuration Register */
/*! @{ */

#define MC_ME_PRTN5_PCONF_PCE_MASK               (0x1U)
#define MC_ME_PRTN5_PCONF_PCE_SHIFT              (0U)
#define MC_ME_PRTN5_PCONF_PCE_WIDTH              (1U)
#define MC_ME_PRTN5_PCONF_PCE(x)                 (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_PCONF_PCE_SHIFT)) & MC_ME_PRTN5_PCONF_PCE_MASK)
/*! @} */

/*! @name PRTN5_PUPD - Partition 5 Process Update Register */
/*! @{ */

