zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_ME.h
#define MC_ME_PRTN5_PUPD_PCUD_MASK               (0x1U)
#define MC_ME_PRTN5_PUPD_PCUD_SHIFT              (0U)
#define MC_ME_PRTN5_PUPD_PCUD_WIDTH              (1U)
#define MC_ME_PRTN5_PUPD_PCUD(x)                 (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_PUPD_PCUD_SHIFT)) & MC_ME_PRTN5_PUPD_PCUD_MASK)
/*! @} */

/*! @name PRTN5_STAT - Partition 5 Status Register */
/*! @{ */

#define MC_ME_PRTN5_STAT_PCS_MASK                (0x1U)
#define MC_ME_PRTN5_STAT_PCS_SHIFT               (0U)
#define MC_ME_PRTN5_STAT_PCS_WIDTH               (1U)
#define MC_ME_PRTN5_STAT_PCS(x)                  (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_STAT_PCS_SHIFT)) & MC_ME_PRTN5_STAT_PCS_MASK)
/*! @} */

/*! @name PRTN5_COFB0_STAT - Partition 5 COFB Set 0 Clock Status Register */
/*! @{ */

#define MC_ME_PRTN5_COFB0_STAT_BLOCK1_MASK       (0x2U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK1_SHIFT      (1U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK1_WIDTH      (1U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK1(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB0_STAT_BLOCK1_SHIFT)) & MC_ME_PRTN5_COFB0_STAT_BLOCK1_MASK)

#define MC_ME_PRTN5_COFB0_STAT_BLOCK2_MASK       (0x4U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK2_SHIFT      (2U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK2_WIDTH      (1U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK2(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB0_STAT_BLOCK2_SHIFT)) & MC_ME_PRTN5_COFB0_STAT_BLOCK2_MASK)

#define MC_ME_PRTN5_COFB0_STAT_BLOCK3_MASK       (0x8U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK3_SHIFT      (3U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK3_WIDTH      (1U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK3(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB0_STAT_BLOCK3_SHIFT)) & MC_ME_PRTN5_COFB0_STAT_BLOCK3_MASK)

#define MC_ME_PRTN5_COFB0_STAT_BLOCK4_MASK       (0x10U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK4_SHIFT      (4U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK4_WIDTH      (1U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK4(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB0_STAT_BLOCK4_SHIFT)) & MC_ME_PRTN5_COFB0_STAT_BLOCK4_MASK)

#define MC_ME_PRTN5_COFB0_STAT_BLOCK5_MASK       (0x20U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK5_SHIFT      (5U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK5_WIDTH      (1U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK5(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB0_STAT_BLOCK5_SHIFT)) & MC_ME_PRTN5_COFB0_STAT_BLOCK5_MASK)

#define MC_ME_PRTN5_COFB0_STAT_BLOCK6_MASK       (0x40U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK6_SHIFT      (6U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK6_WIDTH      (1U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK6(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB0_STAT_BLOCK6_SHIFT)) & MC_ME_PRTN5_COFB0_STAT_BLOCK6_MASK)

#define MC_ME_PRTN5_COFB0_STAT_BLOCK7_MASK       (0x80U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK7_SHIFT      (7U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK7_WIDTH      (1U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK7(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB0_STAT_BLOCK7_SHIFT)) & MC_ME_PRTN5_COFB0_STAT_BLOCK7_MASK)

#define MC_ME_PRTN5_COFB0_STAT_BLOCK8_MASK       (0x100U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK8_SHIFT      (8U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK8_WIDTH      (1U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK8(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB0_STAT_BLOCK8_SHIFT)) & MC_ME_PRTN5_COFB0_STAT_BLOCK8_MASK)

#define MC_ME_PRTN5_COFB0_STAT_BLOCK10_MASK      (0x400U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK10_SHIFT     (10U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK10_WIDTH     (1U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK10(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB0_STAT_BLOCK10_SHIFT)) & MC_ME_PRTN5_COFB0_STAT_BLOCK10_MASK)

#define MC_ME_PRTN5_COFB0_STAT_BLOCK12_MASK      (0x1000U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK12_SHIFT     (12U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK12_WIDTH     (1U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK12(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB0_STAT_BLOCK12_SHIFT)) & MC_ME_PRTN5_COFB0_STAT_BLOCK12_MASK)

#define MC_ME_PRTN5_COFB0_STAT_BLOCK14_MASK      (0x4000U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK14_SHIFT     (14U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK14_WIDTH     (1U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK14(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB0_STAT_BLOCK14_SHIFT)) & MC_ME_PRTN5_COFB0_STAT_BLOCK14_MASK)

#define MC_ME_PRTN5_COFB0_STAT_BLOCK16_MASK      (0x10000U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK16_SHIFT     (16U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK16_WIDTH     (1U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK16(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB0_STAT_BLOCK16_SHIFT)) & MC_ME_PRTN5_COFB0_STAT_BLOCK16_MASK)

#define MC_ME_PRTN5_COFB0_STAT_BLOCK18_MASK      (0x40000U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK18_SHIFT     (18U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK18_WIDTH     (1U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK18(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB0_STAT_BLOCK18_SHIFT)) & MC_ME_PRTN5_COFB0_STAT_BLOCK18_MASK)

#define MC_ME_PRTN5_COFB0_STAT_BLOCK20_MASK      (0x100000U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK20_SHIFT     (20U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK20_WIDTH     (1U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK20(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB0_STAT_BLOCK20_SHIFT)) & MC_ME_PRTN5_COFB0_STAT_BLOCK20_MASK)

#define MC_ME_PRTN5_COFB0_STAT_BLOCK22_MASK      (0x400000U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK22_SHIFT     (22U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK22_WIDTH     (1U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK22(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB0_STAT_BLOCK22_SHIFT)) & MC_ME_PRTN5_COFB0_STAT_BLOCK22_MASK)

#define MC_ME_PRTN5_COFB0_STAT_BLOCK24_MASK      (0x1000000U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK24_SHIFT     (24U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK24_WIDTH     (1U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK24(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB0_STAT_BLOCK24_SHIFT)) & MC_ME_PRTN5_COFB0_STAT_BLOCK24_MASK)

#define MC_ME_PRTN5_COFB0_STAT_BLOCK26_MASK      (0x4000000U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK26_SHIFT     (26U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK26_WIDTH     (1U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK26(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB0_STAT_BLOCK26_SHIFT)) & MC_ME_PRTN5_COFB0_STAT_BLOCK26_MASK)

#define MC_ME_PRTN5_COFB0_STAT_BLOCK27_MASK      (0x8000000U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK27_SHIFT     (27U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK27_WIDTH     (1U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK27(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB0_STAT_BLOCK27_SHIFT)) & MC_ME_PRTN5_COFB0_STAT_BLOCK27_MASK)

#define MC_ME_PRTN5_COFB0_STAT_BLOCK28_MASK      (0x10000000U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK28_SHIFT     (28U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK28_WIDTH     (1U)
#define MC_ME_PRTN5_COFB0_STAT_BLOCK28(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB0_STAT_BLOCK28_SHIFT)) & MC_ME_PRTN5_COFB0_STAT_BLOCK28_MASK)

