zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_ME.h
#define MC_ME_PRTN5_COFB2_STAT_BLOCK94_MASK      (0x40000000U)
#define MC_ME_PRTN5_COFB2_STAT_BLOCK94_SHIFT     (30U)
#define MC_ME_PRTN5_COFB2_STAT_BLOCK94_WIDTH     (1U)
#define MC_ME_PRTN5_COFB2_STAT_BLOCK94(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB2_STAT_BLOCK94_SHIFT)) & MC_ME_PRTN5_COFB2_STAT_BLOCK94_MASK)

#define MC_ME_PRTN5_COFB2_STAT_BLOCK95_MASK      (0x80000000U)
#define MC_ME_PRTN5_COFB2_STAT_BLOCK95_SHIFT     (31U)
#define MC_ME_PRTN5_COFB2_STAT_BLOCK95_WIDTH     (1U)
#define MC_ME_PRTN5_COFB2_STAT_BLOCK95(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB2_STAT_BLOCK95_SHIFT)) & MC_ME_PRTN5_COFB2_STAT_BLOCK95_MASK)
/*! @} */

/*! @name PRTN5_COFB3_STAT - Partition 5 COFB Set 3 Clock Status Register */
/*! @{ */

#define MC_ME_PRTN5_COFB3_STAT_BLOCK96_MASK      (0x1U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK96_SHIFT     (0U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK96_WIDTH     (1U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK96(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB3_STAT_BLOCK96_SHIFT)) & MC_ME_PRTN5_COFB3_STAT_BLOCK96_MASK)

#define MC_ME_PRTN5_COFB3_STAT_BLOCK97_MASK      (0x2U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK97_SHIFT     (1U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK97_WIDTH     (1U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK97(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB3_STAT_BLOCK97_SHIFT)) & MC_ME_PRTN5_COFB3_STAT_BLOCK97_MASK)

#define MC_ME_PRTN5_COFB3_STAT_BLOCK98_MASK      (0x4U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK98_SHIFT     (2U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK98_WIDTH     (1U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK98(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB3_STAT_BLOCK98_SHIFT)) & MC_ME_PRTN5_COFB3_STAT_BLOCK98_MASK)

#define MC_ME_PRTN5_COFB3_STAT_BLOCK99_MASK      (0x8U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK99_SHIFT     (3U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK99_WIDTH     (1U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK99(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB3_STAT_BLOCK99_SHIFT)) & MC_ME_PRTN5_COFB3_STAT_BLOCK99_MASK)

#define MC_ME_PRTN5_COFB3_STAT_BLOCK100_MASK     (0x10U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK100_SHIFT    (4U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK100_WIDTH    (1U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK100(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB3_STAT_BLOCK100_SHIFT)) & MC_ME_PRTN5_COFB3_STAT_BLOCK100_MASK)

#define MC_ME_PRTN5_COFB3_STAT_BLOCK101_MASK     (0x20U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK101_SHIFT    (5U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK101_WIDTH    (1U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK101(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB3_STAT_BLOCK101_SHIFT)) & MC_ME_PRTN5_COFB3_STAT_BLOCK101_MASK)

#define MC_ME_PRTN5_COFB3_STAT_BLOCK102_MASK     (0x40U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK102_SHIFT    (6U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK102_WIDTH    (1U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK102(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB3_STAT_BLOCK102_SHIFT)) & MC_ME_PRTN5_COFB3_STAT_BLOCK102_MASK)

#define MC_ME_PRTN5_COFB3_STAT_BLOCK103_MASK     (0x80U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK103_SHIFT    (7U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK103_WIDTH    (1U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK103(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB3_STAT_BLOCK103_SHIFT)) & MC_ME_PRTN5_COFB3_STAT_BLOCK103_MASK)

#define MC_ME_PRTN5_COFB3_STAT_BLOCK104_MASK     (0x100U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK104_SHIFT    (8U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK104_WIDTH    (1U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK104(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB3_STAT_BLOCK104_SHIFT)) & MC_ME_PRTN5_COFB3_STAT_BLOCK104_MASK)

#define MC_ME_PRTN5_COFB3_STAT_BLOCK105_MASK     (0x200U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK105_SHIFT    (9U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK105_WIDTH    (1U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK105(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB3_STAT_BLOCK105_SHIFT)) & MC_ME_PRTN5_COFB3_STAT_BLOCK105_MASK)

#define MC_ME_PRTN5_COFB3_STAT_BLOCK106_MASK     (0x400U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK106_SHIFT    (10U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK106_WIDTH    (1U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK106(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB3_STAT_BLOCK106_SHIFT)) & MC_ME_PRTN5_COFB3_STAT_BLOCK106_MASK)

#define MC_ME_PRTN5_COFB3_STAT_BLOCK107_MASK     (0x800U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK107_SHIFT    (11U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK107_WIDTH    (1U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK107(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB3_STAT_BLOCK107_SHIFT)) & MC_ME_PRTN5_COFB3_STAT_BLOCK107_MASK)

#define MC_ME_PRTN5_COFB3_STAT_BLOCK108_MASK     (0x1000U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK108_SHIFT    (12U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK108_WIDTH    (1U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK108(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB3_STAT_BLOCK108_SHIFT)) & MC_ME_PRTN5_COFB3_STAT_BLOCK108_MASK)

#define MC_ME_PRTN5_COFB3_STAT_BLOCK109_MASK     (0x2000U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK109_SHIFT    (13U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK109_WIDTH    (1U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK109(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB3_STAT_BLOCK109_SHIFT)) & MC_ME_PRTN5_COFB3_STAT_BLOCK109_MASK)

#define MC_ME_PRTN5_COFB3_STAT_BLOCK110_MASK     (0x4000U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK110_SHIFT    (14U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK110_WIDTH    (1U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK110(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB3_STAT_BLOCK110_SHIFT)) & MC_ME_PRTN5_COFB3_STAT_BLOCK110_MASK)

#define MC_ME_PRTN5_COFB3_STAT_BLOCK111_MASK     (0x8000U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK111_SHIFT    (15U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK111_WIDTH    (1U)
#define MC_ME_PRTN5_COFB3_STAT_BLOCK111(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB3_STAT_BLOCK111_SHIFT)) & MC_ME_PRTN5_COFB3_STAT_BLOCK111_MASK)
/*! @} */

/*! @name PRTN5_COFB0_CLKEN - Partition 5 COFB Set 0 Clock Enable Register */
/*! @{ */

#define MC_ME_PRTN5_COFB0_CLKEN_REQ2_MASK        (0x4U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ2_SHIFT       (2U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ2_WIDTH       (1U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ2(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB0_CLKEN_REQ2_SHIFT)) & MC_ME_PRTN5_COFB0_CLKEN_REQ2_MASK)

#define MC_ME_PRTN5_COFB0_CLKEN_REQ3_MASK        (0x8U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ3_SHIFT       (3U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ3_WIDTH       (1U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ3(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB0_CLKEN_REQ3_SHIFT)) & MC_ME_PRTN5_COFB0_CLKEN_REQ3_MASK)

