zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_ME.h
#define MC_ME_PRTN5_COFB0_CLKEN_REQ4_MASK        (0x10U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ4_SHIFT       (4U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ4_WIDTH       (1U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ4(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB0_CLKEN_REQ4_SHIFT)) & MC_ME_PRTN5_COFB0_CLKEN_REQ4_MASK)

#define MC_ME_PRTN5_COFB0_CLKEN_REQ5_MASK        (0x20U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ5_SHIFT       (5U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ5_WIDTH       (1U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ5(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB0_CLKEN_REQ5_SHIFT)) & MC_ME_PRTN5_COFB0_CLKEN_REQ5_MASK)

#define MC_ME_PRTN5_COFB0_CLKEN_REQ6_MASK        (0x40U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ6_SHIFT       (6U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ6_WIDTH       (1U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ6(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB0_CLKEN_REQ6_SHIFT)) & MC_ME_PRTN5_COFB0_CLKEN_REQ6_MASK)

#define MC_ME_PRTN5_COFB0_CLKEN_REQ7_MASK        (0x80U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ7_SHIFT       (7U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ7_WIDTH       (1U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ7(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB0_CLKEN_REQ7_SHIFT)) & MC_ME_PRTN5_COFB0_CLKEN_REQ7_MASK)

#define MC_ME_PRTN5_COFB0_CLKEN_REQ8_MASK        (0x100U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ8_SHIFT       (8U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ8_WIDTH       (1U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ8(x)          (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB0_CLKEN_REQ8_SHIFT)) & MC_ME_PRTN5_COFB0_CLKEN_REQ8_MASK)

#define MC_ME_PRTN5_COFB0_CLKEN_REQ10_MASK       (0x400U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ10_SHIFT      (10U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ10_WIDTH      (1U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ10(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB0_CLKEN_REQ10_SHIFT)) & MC_ME_PRTN5_COFB0_CLKEN_REQ10_MASK)

#define MC_ME_PRTN5_COFB0_CLKEN_REQ12_MASK       (0x1000U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ12_SHIFT      (12U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ12_WIDTH      (1U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ12(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB0_CLKEN_REQ12_SHIFT)) & MC_ME_PRTN5_COFB0_CLKEN_REQ12_MASK)

#define MC_ME_PRTN5_COFB0_CLKEN_REQ14_MASK       (0x4000U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ14_SHIFT      (14U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ14_WIDTH      (1U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ14(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB0_CLKEN_REQ14_SHIFT)) & MC_ME_PRTN5_COFB0_CLKEN_REQ14_MASK)

#define MC_ME_PRTN5_COFB0_CLKEN_REQ16_MASK       (0x10000U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ16_SHIFT      (16U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ16_WIDTH      (1U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ16(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB0_CLKEN_REQ16_SHIFT)) & MC_ME_PRTN5_COFB0_CLKEN_REQ16_MASK)

#define MC_ME_PRTN5_COFB0_CLKEN_REQ18_MASK       (0x40000U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ18_SHIFT      (18U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ18_WIDTH      (1U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ18(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB0_CLKEN_REQ18_SHIFT)) & MC_ME_PRTN5_COFB0_CLKEN_REQ18_MASK)

#define MC_ME_PRTN5_COFB0_CLKEN_REQ20_MASK       (0x100000U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ20_SHIFT      (20U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ20_WIDTH      (1U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ20(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB0_CLKEN_REQ20_SHIFT)) & MC_ME_PRTN5_COFB0_CLKEN_REQ20_MASK)

#define MC_ME_PRTN5_COFB0_CLKEN_REQ22_MASK       (0x400000U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ22_SHIFT      (22U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ22_WIDTH      (1U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ22(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB0_CLKEN_REQ22_SHIFT)) & MC_ME_PRTN5_COFB0_CLKEN_REQ22_MASK)

#define MC_ME_PRTN5_COFB0_CLKEN_REQ26_MASK       (0x4000000U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ26_SHIFT      (26U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ26_WIDTH      (1U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ26(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB0_CLKEN_REQ26_SHIFT)) & MC_ME_PRTN5_COFB0_CLKEN_REQ26_MASK)

#define MC_ME_PRTN5_COFB0_CLKEN_REQ27_MASK       (0x8000000U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ27_SHIFT      (27U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ27_WIDTH      (1U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ27(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB0_CLKEN_REQ27_SHIFT)) & MC_ME_PRTN5_COFB0_CLKEN_REQ27_MASK)

#define MC_ME_PRTN5_COFB0_CLKEN_REQ28_MASK       (0x10000000U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ28_SHIFT      (28U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ28_WIDTH      (1U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ28(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB0_CLKEN_REQ28_SHIFT)) & MC_ME_PRTN5_COFB0_CLKEN_REQ28_MASK)

#define MC_ME_PRTN5_COFB0_CLKEN_REQ29_MASK       (0x20000000U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ29_SHIFT      (29U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ29_WIDTH      (1U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ29(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB0_CLKEN_REQ29_SHIFT)) & MC_ME_PRTN5_COFB0_CLKEN_REQ29_MASK)

#define MC_ME_PRTN5_COFB0_CLKEN_REQ30_MASK       (0x40000000U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ30_SHIFT      (30U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ30_WIDTH      (1U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ30(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB0_CLKEN_REQ30_SHIFT)) & MC_ME_PRTN5_COFB0_CLKEN_REQ30_MASK)

#define MC_ME_PRTN5_COFB0_CLKEN_REQ31_MASK       (0x80000000U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ31_SHIFT      (31U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ31_WIDTH      (1U)
#define MC_ME_PRTN5_COFB0_CLKEN_REQ31(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB0_CLKEN_REQ31_SHIFT)) & MC_ME_PRTN5_COFB0_CLKEN_REQ31_MASK)
/*! @} */

/*! @name PRTN5_COFB1_CLKEN - Partition 5 COFB Set 1 Clock Enable Register */
/*! @{ */

#define MC_ME_PRTN5_COFB1_CLKEN_REQ32_MASK       (0x1U)
#define MC_ME_PRTN5_COFB1_CLKEN_REQ32_SHIFT      (0U)
#define MC_ME_PRTN5_COFB1_CLKEN_REQ32_WIDTH      (1U)
#define MC_ME_PRTN5_COFB1_CLKEN_REQ32(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB1_CLKEN_REQ32_SHIFT)) & MC_ME_PRTN5_COFB1_CLKEN_REQ32_MASK)

