zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_ME.h
#define MC_ME_PRTN5_COFB1_CLKEN_REQ52_MASK       (0x100000U)
#define MC_ME_PRTN5_COFB1_CLKEN_REQ52_SHIFT      (20U)
#define MC_ME_PRTN5_COFB1_CLKEN_REQ52_WIDTH      (1U)
#define MC_ME_PRTN5_COFB1_CLKEN_REQ52(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB1_CLKEN_REQ52_SHIFT)) & MC_ME_PRTN5_COFB1_CLKEN_REQ52_MASK)

#define MC_ME_PRTN5_COFB1_CLKEN_REQ53_MASK       (0x200000U)
#define MC_ME_PRTN5_COFB1_CLKEN_REQ53_SHIFT      (21U)
#define MC_ME_PRTN5_COFB1_CLKEN_REQ53_WIDTH      (1U)
#define MC_ME_PRTN5_COFB1_CLKEN_REQ53(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB1_CLKEN_REQ53_SHIFT)) & MC_ME_PRTN5_COFB1_CLKEN_REQ53_MASK)

#define MC_ME_PRTN5_COFB1_CLKEN_REQ54_MASK       (0x400000U)
#define MC_ME_PRTN5_COFB1_CLKEN_REQ54_SHIFT      (22U)
#define MC_ME_PRTN5_COFB1_CLKEN_REQ54_WIDTH      (1U)
#define MC_ME_PRTN5_COFB1_CLKEN_REQ54(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB1_CLKEN_REQ54_SHIFT)) & MC_ME_PRTN5_COFB1_CLKEN_REQ54_MASK)

#define MC_ME_PRTN5_COFB1_CLKEN_REQ55_MASK       (0x800000U)
#define MC_ME_PRTN5_COFB1_CLKEN_REQ55_SHIFT      (23U)
#define MC_ME_PRTN5_COFB1_CLKEN_REQ55_WIDTH      (1U)
#define MC_ME_PRTN5_COFB1_CLKEN_REQ55(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB1_CLKEN_REQ55_SHIFT)) & MC_ME_PRTN5_COFB1_CLKEN_REQ55_MASK)

#define MC_ME_PRTN5_COFB1_CLKEN_REQ56_MASK       (0x1000000U)
#define MC_ME_PRTN5_COFB1_CLKEN_REQ56_SHIFT      (24U)
#define MC_ME_PRTN5_COFB1_CLKEN_REQ56_WIDTH      (1U)
#define MC_ME_PRTN5_COFB1_CLKEN_REQ56(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB1_CLKEN_REQ56_SHIFT)) & MC_ME_PRTN5_COFB1_CLKEN_REQ56_MASK)

#define MC_ME_PRTN5_COFB1_CLKEN_REQ57_MASK       (0x2000000U)
#define MC_ME_PRTN5_COFB1_CLKEN_REQ57_SHIFT      (25U)
#define MC_ME_PRTN5_COFB1_CLKEN_REQ57_WIDTH      (1U)
#define MC_ME_PRTN5_COFB1_CLKEN_REQ57(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB1_CLKEN_REQ57_SHIFT)) & MC_ME_PRTN5_COFB1_CLKEN_REQ57_MASK)

#define MC_ME_PRTN5_COFB1_CLKEN_REQ58_MASK       (0x4000000U)
#define MC_ME_PRTN5_COFB1_CLKEN_REQ58_SHIFT      (26U)
#define MC_ME_PRTN5_COFB1_CLKEN_REQ58_WIDTH      (1U)
#define MC_ME_PRTN5_COFB1_CLKEN_REQ58(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB1_CLKEN_REQ58_SHIFT)) & MC_ME_PRTN5_COFB1_CLKEN_REQ58_MASK)

#define MC_ME_PRTN5_COFB1_CLKEN_REQ59_MASK       (0x8000000U)
#define MC_ME_PRTN5_COFB1_CLKEN_REQ59_SHIFT      (27U)
#define MC_ME_PRTN5_COFB1_CLKEN_REQ59_WIDTH      (1U)
#define MC_ME_PRTN5_COFB1_CLKEN_REQ59(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB1_CLKEN_REQ59_SHIFT)) & MC_ME_PRTN5_COFB1_CLKEN_REQ59_MASK)

#define MC_ME_PRTN5_COFB1_CLKEN_REQ60_MASK       (0x10000000U)
#define MC_ME_PRTN5_COFB1_CLKEN_REQ60_SHIFT      (28U)
#define MC_ME_PRTN5_COFB1_CLKEN_REQ60_WIDTH      (1U)
#define MC_ME_PRTN5_COFB1_CLKEN_REQ60(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB1_CLKEN_REQ60_SHIFT)) & MC_ME_PRTN5_COFB1_CLKEN_REQ60_MASK)

#define MC_ME_PRTN5_COFB1_CLKEN_REQ61_MASK       (0x20000000U)
#define MC_ME_PRTN5_COFB1_CLKEN_REQ61_SHIFT      (29U)
#define MC_ME_PRTN5_COFB1_CLKEN_REQ61_WIDTH      (1U)
#define MC_ME_PRTN5_COFB1_CLKEN_REQ61(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB1_CLKEN_REQ61_SHIFT)) & MC_ME_PRTN5_COFB1_CLKEN_REQ61_MASK)

#define MC_ME_PRTN5_COFB1_CLKEN_REQ62_MASK       (0x40000000U)
#define MC_ME_PRTN5_COFB1_CLKEN_REQ62_SHIFT      (30U)
#define MC_ME_PRTN5_COFB1_CLKEN_REQ62_WIDTH      (1U)
#define MC_ME_PRTN5_COFB1_CLKEN_REQ62(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB1_CLKEN_REQ62_SHIFT)) & MC_ME_PRTN5_COFB1_CLKEN_REQ62_MASK)

#define MC_ME_PRTN5_COFB1_CLKEN_REQ63_MASK       (0x80000000U)
#define MC_ME_PRTN5_COFB1_CLKEN_REQ63_SHIFT      (31U)
#define MC_ME_PRTN5_COFB1_CLKEN_REQ63_WIDTH      (1U)
#define MC_ME_PRTN5_COFB1_CLKEN_REQ63(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB1_CLKEN_REQ63_SHIFT)) & MC_ME_PRTN5_COFB1_CLKEN_REQ63_MASK)
/*! @} */

/*! @name PRTN5_COFB2_CLKEN - Partition 5 COFB Set 2 Clock Enable Register */
/*! @{ */

#define MC_ME_PRTN5_COFB2_CLKEN_REQ64_MASK       (0x1U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ64_SHIFT      (0U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ64_WIDTH      (1U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ64(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB2_CLKEN_REQ64_SHIFT)) & MC_ME_PRTN5_COFB2_CLKEN_REQ64_MASK)

#define MC_ME_PRTN5_COFB2_CLKEN_REQ65_MASK       (0x2U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ65_SHIFT      (1U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ65_WIDTH      (1U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ65(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB2_CLKEN_REQ65_SHIFT)) & MC_ME_PRTN5_COFB2_CLKEN_REQ65_MASK)

#define MC_ME_PRTN5_COFB2_CLKEN_REQ66_MASK       (0x4U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ66_SHIFT      (2U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ66_WIDTH      (1U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ66(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB2_CLKEN_REQ66_SHIFT)) & MC_ME_PRTN5_COFB2_CLKEN_REQ66_MASK)

#define MC_ME_PRTN5_COFB2_CLKEN_REQ67_MASK       (0x8U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ67_SHIFT      (3U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ67_WIDTH      (1U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ67(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB2_CLKEN_REQ67_SHIFT)) & MC_ME_PRTN5_COFB2_CLKEN_REQ67_MASK)

#define MC_ME_PRTN5_COFB2_CLKEN_REQ70_MASK       (0x40U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ70_SHIFT      (6U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ70_WIDTH      (1U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ70(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB2_CLKEN_REQ70_SHIFT)) & MC_ME_PRTN5_COFB2_CLKEN_REQ70_MASK)

#define MC_ME_PRTN5_COFB2_CLKEN_REQ71_MASK       (0x80U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ71_SHIFT      (7U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ71_WIDTH      (1U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ71(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB2_CLKEN_REQ71_SHIFT)) & MC_ME_PRTN5_COFB2_CLKEN_REQ71_MASK)

#define MC_ME_PRTN5_COFB2_CLKEN_REQ72_MASK       (0x100U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ72_SHIFT      (8U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ72_WIDTH      (1U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ72(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB2_CLKEN_REQ72_SHIFT)) & MC_ME_PRTN5_COFB2_CLKEN_REQ72_MASK)

#define MC_ME_PRTN5_COFB2_CLKEN_REQ73_MASK       (0x200U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ73_SHIFT      (9U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ73_WIDTH      (1U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ73(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB2_CLKEN_REQ73_SHIFT)) & MC_ME_PRTN5_COFB2_CLKEN_REQ73_MASK)

#define MC_ME_PRTN5_COFB2_CLKEN_REQ80_MASK       (0x10000U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ80_SHIFT      (16U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ80_WIDTH      (1U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ80(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB2_CLKEN_REQ80_SHIFT)) & MC_ME_PRTN5_COFB2_CLKEN_REQ80_MASK)

#define MC_ME_PRTN5_COFB2_CLKEN_REQ82_MASK       (0x40000U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ82_SHIFT      (18U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ82_WIDTH      (1U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ82(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB2_CLKEN_REQ82_SHIFT)) & MC_ME_PRTN5_COFB2_CLKEN_REQ82_MASK)

#define MC_ME_PRTN5_COFB2_CLKEN_REQ83_MASK       (0x80000U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ83_SHIFT      (19U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ83_WIDTH      (1U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ83(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB2_CLKEN_REQ83_SHIFT)) & MC_ME_PRTN5_COFB2_CLKEN_REQ83_MASK)

