zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_ME.h
#define MC_ME_PRTN5_COFB2_CLKEN_REQ84_MASK       (0x100000U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ84_SHIFT      (20U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ84_WIDTH      (1U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ84(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB2_CLKEN_REQ84_SHIFT)) & MC_ME_PRTN5_COFB2_CLKEN_REQ84_MASK)

#define MC_ME_PRTN5_COFB2_CLKEN_REQ87_MASK       (0x800000U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ87_SHIFT      (23U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ87_WIDTH      (1U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ87(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB2_CLKEN_REQ87_SHIFT)) & MC_ME_PRTN5_COFB2_CLKEN_REQ87_MASK)

#define MC_ME_PRTN5_COFB2_CLKEN_REQ88_MASK       (0x1000000U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ88_SHIFT      (24U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ88_WIDTH      (1U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ88(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB2_CLKEN_REQ88_SHIFT)) & MC_ME_PRTN5_COFB2_CLKEN_REQ88_MASK)

#define MC_ME_PRTN5_COFB2_CLKEN_REQ94_MASK       (0x40000000U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ94_SHIFT      (30U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ94_WIDTH      (1U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ94(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB2_CLKEN_REQ94_SHIFT)) & MC_ME_PRTN5_COFB2_CLKEN_REQ94_MASK)

#define MC_ME_PRTN5_COFB2_CLKEN_REQ95_MASK       (0x80000000U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ95_SHIFT      (31U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ95_WIDTH      (1U)
#define MC_ME_PRTN5_COFB2_CLKEN_REQ95(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB2_CLKEN_REQ95_SHIFT)) & MC_ME_PRTN5_COFB2_CLKEN_REQ95_MASK)
/*! @} */

/*! @name PRTN5_COFB3_CLKEN - Partition 5 COFB Set 3 Clock Enable Register */
/*! @{ */

#define MC_ME_PRTN5_COFB3_CLKEN_REQ96_MASK       (0x1U)
#define MC_ME_PRTN5_COFB3_CLKEN_REQ96_SHIFT      (0U)
#define MC_ME_PRTN5_COFB3_CLKEN_REQ96_WIDTH      (1U)
#define MC_ME_PRTN5_COFB3_CLKEN_REQ96(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB3_CLKEN_REQ96_SHIFT)) & MC_ME_PRTN5_COFB3_CLKEN_REQ96_MASK)

#define MC_ME_PRTN5_COFB3_CLKEN_REQ97_MASK       (0x2U)
#define MC_ME_PRTN5_COFB3_CLKEN_REQ97_SHIFT      (1U)
#define MC_ME_PRTN5_COFB3_CLKEN_REQ97_WIDTH      (1U)
#define MC_ME_PRTN5_COFB3_CLKEN_REQ97(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB3_CLKEN_REQ97_SHIFT)) & MC_ME_PRTN5_COFB3_CLKEN_REQ97_MASK)

#define MC_ME_PRTN5_COFB3_CLKEN_REQ98_MASK       (0x4U)
#define MC_ME_PRTN5_COFB3_CLKEN_REQ98_SHIFT      (2U)
#define MC_ME_PRTN5_COFB3_CLKEN_REQ98_WIDTH      (1U)
#define MC_ME_PRTN5_COFB3_CLKEN_REQ98(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB3_CLKEN_REQ98_SHIFT)) & MC_ME_PRTN5_COFB3_CLKEN_REQ98_MASK)

#define MC_ME_PRTN5_COFB3_CLKEN_REQ99_MASK       (0x8U)
#define MC_ME_PRTN5_COFB3_CLKEN_REQ99_SHIFT      (3U)
#define MC_ME_PRTN5_COFB3_CLKEN_REQ99_WIDTH      (1U)
#define MC_ME_PRTN5_COFB3_CLKEN_REQ99(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB3_CLKEN_REQ99_SHIFT)) & MC_ME_PRTN5_COFB3_CLKEN_REQ99_MASK)

#define MC_ME_PRTN5_COFB3_CLKEN_REQ100_MASK      (0x10U)
#define MC_ME_PRTN5_COFB3_CLKEN_REQ100_SHIFT     (4U)
#define MC_ME_PRTN5_COFB3_CLKEN_REQ100_WIDTH     (1U)
#define MC_ME_PRTN5_COFB3_CLKEN_REQ100(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB3_CLKEN_REQ100_SHIFT)) & MC_ME_PRTN5_COFB3_CLKEN_REQ100_MASK)

#define MC_ME_PRTN5_COFB3_CLKEN_REQ101_MASK      (0x20U)
#define MC_ME_PRTN5_COFB3_CLKEN_REQ101_SHIFT     (5U)
#define MC_ME_PRTN5_COFB3_CLKEN_REQ101_WIDTH     (1U)
#define MC_ME_PRTN5_COFB3_CLKEN_REQ101(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB3_CLKEN_REQ101_SHIFT)) & MC_ME_PRTN5_COFB3_CLKEN_REQ101_MASK)

#define MC_ME_PRTN5_COFB3_CLKEN_REQ102_MASK      (0x40U)
#define MC_ME_PRTN5_COFB3_CLKEN_REQ102_SHIFT     (6U)
#define MC_ME_PRTN5_COFB3_CLKEN_REQ102_WIDTH     (1U)
#define MC_ME_PRTN5_COFB3_CLKEN_REQ102(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB3_CLKEN_REQ102_SHIFT)) & MC_ME_PRTN5_COFB3_CLKEN_REQ102_MASK)

#define MC_ME_PRTN5_COFB3_CLKEN_REQ103_MASK      (0x80U)
#define MC_ME_PRTN5_COFB3_CLKEN_REQ103_SHIFT     (7U)
#define MC_ME_PRTN5_COFB3_CLKEN_REQ103_WIDTH     (1U)
#define MC_ME_PRTN5_COFB3_CLKEN_REQ103(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB3_CLKEN_REQ103_SHIFT)) & MC_ME_PRTN5_COFB3_CLKEN_REQ103_MASK)

#define MC_ME_PRTN5_COFB3_CLKEN_REQ104_MASK      (0x100U)
#define MC_ME_PRTN5_COFB3_CLKEN_REQ104_SHIFT     (8U)
#define MC_ME_PRTN5_COFB3_CLKEN_REQ104_WIDTH     (1U)
#define MC_ME_PRTN5_COFB3_CLKEN_REQ104(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB3_CLKEN_REQ104_SHIFT)) & MC_ME_PRTN5_COFB3_CLKEN_REQ104_MASK)

#define MC_ME_PRTN5_COFB3_CLKEN_REQ105_MASK      (0x200U)
#define MC_ME_PRTN5_COFB3_CLKEN_REQ105_SHIFT     (9U)
#define MC_ME_PRTN5_COFB3_CLKEN_REQ105_WIDTH     (1U)
#define MC_ME_PRTN5_COFB3_CLKEN_REQ105(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB3_CLKEN_REQ105_SHIFT)) & MC_ME_PRTN5_COFB3_CLKEN_REQ105_MASK)

#define MC_ME_PRTN5_COFB3_CLKEN_REQ106_MASK      (0x400U)
#define MC_ME_PRTN5_COFB3_CLKEN_REQ106_SHIFT     (10U)
#define MC_ME_PRTN5_COFB3_CLKEN_REQ106_WIDTH     (1U)
#define MC_ME_PRTN5_COFB3_CLKEN_REQ106(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN5_COFB3_CLKEN_REQ106_SHIFT)) & MC_ME_PRTN5_COFB3_CLKEN_REQ106_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group MC_ME_Register_Masks */

/*!
 * @}
 */ /* end of group MC_ME_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_MC_ME_H_) */
